config.org
#+TITLE: EMACS configuration
#+AUTHOR: ODIN
#+TAGS: Arjen wolray Fabrice mine MELPA_ori


