config.org
* Questions related Emacs initiation.
** what is the package loading Vs lisp loading; [[http://emacs.stackexchange.com/questions/3310/difference-between-load-file-and-load][Answer from stack exchange]]
*** [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Package-Installation.html][package loading]]
- [[help:use-package][use-package]] from package.el
- [[help:package-selected-packages][package-selected-packages]] used as a default for custom.el defined in package.el.
  - package-install-p: confirm package is installed.
- loading a package adds its directory to load-path and loads its autoloads.
- ‘-q’ or ‘--no-init-file’ options inhibit this behaviour.
*** [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Lisp-Libraries.html#Lisp-Libraries][lisp loading]]
- byte compilation and .elc
- M-x load-file/load-library
- Variable load-path
- autoload: M-x compile/recompile
- [[help:require][require]]: a primitive function
** what is all the "smart" package is all about
*** these package include
- [[https://github.com/Fuco1/smartparens][smartparens]] (sp) by Fuco1
- smart-mode-line
** key binding, in the context of usepackage and normal key binding 
- [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Init-Rebinding.html][demystify escape sign in kbd]]
* Personal Information

#+begin_src emacs-lisp
(setq user-full-name "Guo Shiyuan"
      user-mail-address "antguos@nus.edu.sg")
#+end_src

* Customize settings
Set up the customize file to its [[help:custom-file][own separate file]], instead of saving
customize settings in .emacs

#+begin_src
(setq custom-file (expand-file-name "custom.el" user-emacs-directory))
(load custom-file)
#+end_src

* benchmark
#+BEGIN_SRC emacs-lisp
(use-package benchmark-init
  :ensure t
  :init
  (benchmark-init/activate))
#+END_SRC
* security 
#+BEGIN_SRC emacs-lisp
(require 'epa-file)
(custom-set-variables '(epg-gpg-program  "/usr/local/bin/gpg2"))
(epa-file-enable)
#+END_SRC
* Theme and theme library in  [[https://emacsthemes.com][emacs theme page]]
- Theme are color combinations. Deciding this combination is arguably [[http://geog.uoregon.edu/datagraphics/EOS/Light-and-Bartlein_EOS2004.pdf][difficult.]]
- There are various color palettes for scientific application (in general or in R setting).
- [[http://colorbrewer2.org/#type=diverging&scheme=BrBG&n=3][colorbrewer]] is a good place to find colour combi
** my preferred theme:
  - src block has diff (darker) background (#2a2f38) as compared to normal text
  - the org-src-header and end are boarded and diff color (#bdc3ce and weighted) as compared to other.

** Cyberpunk theme: Dark background+colorful headline.

#+begin_src
(use-package cyberpunk-theme
  :if (window-system)
  :ensure t
  :init
  (progn
    (load-theme 'cyberpunk t)
    (set-face-attribute `mode-line nil
			:box nil)
    (set-face-attribute `mode-line-inactive nil
			:box nil)))
#+end_src

** solarised

#+BEGIN_SRC
(use-package solarized-theme
  :defer 10
  :init
  (setq solarized-use-variable-pitch nil)
  :ensure t)
#+END_SRC

** BEST1: [[https://github.com/bbatsov/zenburn-emacs][zenburn]].
*** Zenburn default
**** DONE problem related to strange color with underline_proceeding in Zenburn default
**** org-date == lvl5
**** org-link == lvl4
|----------+-------------+---------|
| category | speific     | color   |
|----------+-------------+---------|
| org      | lvl1 header | #DFAF8F |
|          | lvl2 header | #BFEBBF |
|          | lvl3 header | #7CB8BB |
|          | lvl4 header | #D0BF8F |
|          | lvl5 header | #93E0E3 |
|          | org-date    | #8CD0D3 |
|          | org-link    | #D0BF8F |
|          |             |         |
#+BEGIN_SRC emacs-lisp
(use-package zenburn-theme
 :ensure t
 :init)

(set-face-italic-p 'italic nil)
(set-face-attribute 'region nil :background "#c51b7d" )
#+END_SRC


** CANCELED BEST2: arjen-grey-theme
- [[https://gitlab.com/buildfunthings/emacs-config/blob/master/loader.org][arjen font ]]
#+BEGIN_SRC
(use-package arjen-grey-theme
  :ensure t
  :config
  (load-theme 'arjen-grey t))

;;(if (eq system-type 'darwin)
    ;;(set-face-attribute 'default nil :font "Hack-14")
  ;;(set-face-attribute 'default nil :font "DejaVu Sans Mono" :height 110))

(use-package command-log-mode
  :ensure t)

;;(defun live-coding ()
  ;;(interactive)
  ;;(set-face-attribute 'default nil :font "Hack-16")
  ;;(add-hook 'prog-mode-hook 'command-log-mode))

(eval-after-load "org-indent" '(diminish 'org-indent-mode))

;;   (use-package all-the-icons
;;     :ensure t)
#+END_SRC
** CANCELED kbd for switch code.
#+BEGIN_SRC
(defun switch-theme (theme)
  "Disables any currently active themes and loads THEME."
  ;; This interactive call is taken from `load-theme'
  (interactive
   (list
    (intern (completing-read "Load custom theme: "
			     (mapc 'symbol-name
				   (custom-available-themes))))))
  (let ((enabled-themes custom-enabled-themes))
    (mapc #'disable-theme custom-enabled-themes)
    (load-theme theme t)))

(defun disable-active-themes ()
  "Disables any currently active themes listed in `custom-enabled-themes'."
  (interactive)
  (mapc #'disable-theme custom-enabled-themes))

;;(global-set-key "s-<f8>" 'switch-theme)
;;(global-set-key "s-<f7>" 'disable-active-themes)

#+END_SRC
** check for the face at point position
#+BEGIN_SRC emacs-lisp
(defun what-face (pos)
  (interactive "d")
  (let ((face (or (get-char-property (point) 'read-face-name)
		  (get-char-property (point) 'face))))
    (if face (message "Face: %s" face) (message "No face at %d" pos))))

#+END_SRC

* Miscellaneous default
** Visual
#+BEGIN_SRC emacs-lisp
(global-linum-mode 1) ;line number mode
(delete-selection-mode t) ;delete the region when typing, just like as we expect nowadays.
(column-number-mode t)
(defalias 'yes-or-no-p 'y-or-n-p) ;Answering just 'y' or 'n' will do
(blink-cursor-mode -1) ;Turn off the blinking cursor
(setq-default indicate-empty-lines t) ;Visually indicate empty lines after the buffer end.
(setq sentence-end-double-space nil) ;one space to end a sentence

(setq uniquify-buffer-name-style 'forward) ;syntax to contruct unique buffer names for files with the same baes name.

(scroll-bar-mode -1) ;; no scoll bar
(tool-bar-mode -1) 
(menu-bar-mode -1)
;; (set-default-font "Source Code Pro" nil t)
;; (set-face-attribute 'default nil :height 100)

(setq battery-mode-line-format "[%b%p%% %t]")
#+END_SRC
