config.md


<a id="org145a429"></a>

# Questions related Emacs initiation.


<a id="org50be7ab"></a>

## what is the package loading Vs lisp loading; [Answer from stack exchange](http://emacs.stackexchange.com/questions/3310/difference-between-load-file-and-load)


<a id="orgcb8fb48"></a>

### [package loading](https://www.gnu.org/software/emacs/manual/html_node/emacs/Package-Installation.html)

-   [use-package](use-package) from package.el
-   [package-selected-packages](package-selected-packages) used as a default for custom.el defined in package.el.
    -   package-install-p: confirm package is installed.
-   loading a package adds its directory to load-path and loads its autoloads.
-   ‘-q’ or ‘&#x2013;no-init-file’ options inhibit this behaviour.


<a id="orgd4ca822"></a>

### [lisp loading](https://www.gnu.org/software/emacs/manual/html_node/emacs/Lisp-Libraries.html#Lisp-Libraries)

-   byte compilation and .elc
-   M-x load-file/load-library
-   Variable load-path
-   autoload: M-x compile/recompile
-   [require](require): a primitive function


<a id="orgd2201b4"></a>

## what is all the "smart" package is all about


<a id="org27e2c3d"></a>

### these package include

-   [smartparens](https://github.com/Fuco1/smartparens) (sp) by Fuco1
-   smart-mode-line


<a id="orgd07eeb5"></a>

## key binding, in the context of usepackage and normal key binding

-   [demystify escape sign in kbd](https://www.gnu.org/software/emacs/manual/html_node/emacs/Init-Rebinding.html)


<a id="org081ae19"></a>

# Personal Information

```emacs-lisp
(setq user-full-name "Guo Shiyuan"
      user-mail-address "antguos@nus.edu.sg")
```


<a id="orge7fcf95"></a>

# Customize settings

Set up the customize file to its [own separate file](custom-file), instead of saving customize settings in .emacs

```
(setq custom-file (expand-file-name "custom.el" user-emacs-directory))
(load custom-file)
```


<a id="orgab8b8c6"></a>

# benchmark

```emacs-lisp
(use-package benchmark-init
  :ensure t
  :init
  (benchmark-init/activate))
```


<a id="org0cb2300"></a>

# security

```emacs-lisp
(require 'epa-file)
(custom-set-variables '(epg-gpg-program  "/usr/local/bin/gpg2"))
(epa-file-enable)
```


<a id="orgecc2494"></a>

# Theme and theme library in  [emacs theme page](https://emacsthemes.com)

-   Theme are color combinations. Deciding this combination is arguably [difficult.](http://geog.uoregon.edu/datagraphics/EOS/Light-and-Bartlein_EOS2004.pdf)
-   There are various color palettes for scientific application (in general or in R setting).
-   [colorbrewer](http://colorbrewer2.org/#type=diverging&scheme=BrBG&n=3) is a good place to find colour combi


<a id="orgba21f37"></a>

## my preferred theme:

-   src block has diff (darker) background (#2a2f38) as compared to normal text
-   the org-src-header and end are boarded and diff color (#bdc3ce and weighted) as compared to other.


<a id="org09ea251"></a>

## Cyberpunk theme: Dark background+colorful headline.

```
(use-package cyberpunk-theme
  :if (window-system)
  :ensure t
  :init
  (progn
    (load-theme 'cyberpunk t)
    (set-face-attribute `mode-line nil
			:box nil)
    (set-face-attribute `mode-line-inactive nil
			:box nil)))
```


<a id="orga0a9ffc"></a>

## solarised

```
(use-package solarized-theme
  :defer 10
  :init
  (setq solarized-use-variable-pitch nil)
  :ensure t)
```


<a id="org12a91a9"></a>

## BEST1: [zenburn](https://github.com/bbatsov/zenburn-emacs).


<a id="orgfaa956b"></a>

### Zenburn default

1.  DONE problem related to strange color with underline\_proceeding in Zenburn default

2.  org-date == lvl5

3.  org-link == lvl4

    | category | speific     | color   |
    | org      | lvl1 header | #DFAF8F |
    |          | lvl2 header | #BFEBBF |
    |          | lvl3 header | #7CB8BB |
    |          | lvl4 header | #D0BF8F |
    |          | lvl5 header | #93E0E3 |
    |          | org-date    | #8CD0D3 |
    |          | org-link    | #D0BF8F |
    |          |             |         |
    
    ```emacs-lisp
    (use-package zenburn-theme
     :ensure t
     :init)
    
    (set-face-italic-p 'italic nil)
    (set-face-attribute 'region nil :background "#c51b7d" )
    ```


<a id="org29e5f74"></a>

## BEST2: arjen-grey-theme

-   [arjen font ](https://gitlab.com/buildfunthings/emacs-config/blob/master/loader.org)

```
(use-package arjen-grey-theme
  :ensure t
  :config
  (load-theme 'arjen-grey t))

;;(if (eq system-type 'darwin)
    ;;(set-face-attribute 'default nil :font "Hack-14")
  ;;(set-face-attribute 'default nil :font "DejaVu Sans Mono" :height 110))

(use-package command-log-mode
  :ensure t)

;;(defun live-coding ()
  ;;(interactive)
  ;;(set-face-attribute 'default nil :font "Hack-16")
  ;;(add-hook 'prog-mode-hook 'command-log-mode))

(eval-after-load "org-indent" '(diminish 'org-indent-mode))

;;   (use-package all-the-icons
;;     :ensure t)
```


<a id="org148b442"></a>

## kbd for switch code.

```
(defun switch-theme (theme)
  "Disables any currently active themes and loads THEME."
  ;; This interactive call is taken from `load-theme'
  (interactive
   (list
    (intern (completing-read "Load custom theme: "
			     (mapc 'symbol-name
				   (custom-available-themes))))))
  (let ((enabled-themes custom-enabled-themes))
    (mapc #'disable-theme custom-enabled-themes)
    (load-theme theme t)))

(defun disable-active-themes ()
  "Disables any currently active themes listed in `custom-enabled-themes'."
  (interactive)
  (mapc #'disable-theme custom-enabled-themes))

;;(global-set-key "s-<f8>" 'switch-theme)
;;(global-set-key "s-<f7>" 'disable-active-themes)
```


<a id="org923d53d"></a>

## check for the face at point position

```emacs-lisp
(defun what-face (pos)
  (interactive "d")
  (let ((face (or (get-char-property (point) 'read-face-name)
		  (get-char-property (point) 'face))))
    (if face (message "Face: %s" face) (message "No face at %d" pos))))
```


<a id="org6ab757c"></a>

# Miscellaneous default


<a id="org525c6d0"></a>

## Visual

```emacs-lisp
(global-linum-mode 1) ;line number mode
(delete-selection-mode t) ;delete the region when typing, just like as we expect nowadays.
(column-number-mode t)
(defalias 'yes-or-no-p 'y-or-n-p) ;Answering just 'y' or 'n' will do
(blink-cursor-mode -1) ;Turn off the blinking cursor
(setq-default indicate-empty-lines t) ;Visually indicate empty lines after the buffer end.
(setq sentence-end-double-space nil) ;one space to end a sentence

(setq uniquify-buffer-name-style 'forward) ;syntax to contruct unique buffer names for files with the same baes name.

(scroll-bar-mode -1) ;; no scoll bar
(tool-bar-mode -1) 
(menu-bar-mode -1)
;; (set-default-font "Source Code Pro" nil t)
;; (set-face-attribute 'default nil :height 100)

(setq battery-mode-line-format "[%b%p%% %t]")
```
