config.el
(setq user-full-name "Guo Shiyuan"
      user-mail-address "antguos@nus.edu.sg")

(use-package benchmark-init
  :ensure t
  :init
  (benchmark-init/activate))

(require 'epa-file)
(custom-set-variables '(epg-gpg-program  "/usr/local/bin/gpg2"))
(epa-file-enable)

(use-package zenburn-theme
 :ensure t
 :init)

(set-face-italic-p 'italic nil)
(set-face-attribute 'region nil :background "#c51b7d" )

(defun what-face (pos)
  (interactive "d")
  (let ((face (or (get-char-property (point) 'read-face-name)
		  (get-char-property (point) 'face))))
    (if face (message "Face: %s" face) (message "No face at %d" pos))))

(global-linum-mode 1) ;line number mode
(delete-selection-mode t) ;delete the region when typing, just like as we expect nowadays.
(column-number-mode t)
(defalias 'yes-or-no-p 'y-or-n-p) ;Answering just 'y' or 'n' will do
(blink-cursor-mode -1) ;Turn off the blinking cursor
(setq-default indicate-empty-lines t) ;Visually indicate empty lines after the buffer end.
(setq sentence-end-double-space nil) ;one space to end a sentence

(setq uniquify-buffer-name-style 'forward) ;syntax to contruct unique buffer names for files with the same baes name.

(scroll-bar-mode -1) ;; no scoll bar
(tool-bar-mode -1) 
(menu-bar-mode -1)
;; (set-default-font "Source Code Pro" nil t)
;; (set-face-attribute 'default nil :height 100)

(setq battery-mode-line-format "[%b%p%% %t]")
