config.md


<a id="org1af4d68"></a>

## Utility

```emacs-lisp
;; These functions are useful. Activate them.
(put 'downcase-region 'disabled nil)
(put 'upcase-region 'disabled nil)
(put 'narrow-to-region 'disabled nil)
(put 'dired-find-alternate-file 'disabled nil)

;; UTF-8 please
(setq locale-coding-system 'utf-8) ; pretty
(set-terminal-coding-system 'utf-8) ; pretty
(set-keyboard-coding-system 'utf-8) ; pretty
(set-selection-coding-system 'utf-8) ; please
(prefer-coding-system 'utf-8) ; with sugar on top

;; mode upon opening UTF-8 encoded files.
(add-to-list 'auto-mode-alist '("\\.org\\'" . org-mode))

(setq mouse-wheel-scroll-amount '(1 ((shift) . 1) ((control) . nil)))
(setq mouse-wheel-progressive-speed nil)
```


<a id="org937af0b"></a>

## path issue if starting emacs from finder

```emacs-lisp
;; obsolete method before purcell committed exec-path-from-shell
;; ;; to revert the situ on "incorrect path of pdflatex, thus no pdf compilation"
;; (defun set-exec-path-from-shell-PATH ()
;;   "Sets the exec-path to the same value used by the user shell"
;;   (let ((path-from-shell
;;          (replace-regexp-in-string
;;           "[[:space:]\n]*$" ""
;;           (shell-command-to-string "$SHELL -l -c 'echo $PATH'"))))
;;     (setenv "PATH" path-from-shell)
;;     (setq exec-path (split-string path-from-shell path-separator))))
;; (when (equal system-type 'darwin) (set-exec-path-from-shell-PATH))

;; exec-path-from-shell makes the command-line path with Emacs’s shell match the same one on OS X.
(use-package exec-path-from-shell
  :if (memq window-system '(mac ns))
  :ensure t
  :init
  (exec-path-from-shell-initialize)
  (exec-path-from-shell-copy-env "LC_ALL")
  (exec-path-from-shell-copy-env "LANG"))


(setenv "PATH" (concat (getenv "PATH") ":/usr/local/Cellar"))
```


<a id="org9e83b83"></a>

## file backup and delection

```emacs-lisp
;; Keep all backup and auto-save files in one directory
(setq auto-save-file-name-transforms '((".*" "~/.emacs.d/autosaves/\\1" t)))
(setq backup-directory-alist '(("." . "~/.emacs.d/backup"))
      backup-by-copying t    ; Don't delink hardlinks
      version-control t      ; Use version numbers on backups
      delete-old-versions t  ; Automatically delete excess backups
      kept-new-versions 20   ; how many of the newest versions to keep
      kept-old-versions 5    ; and how many of the old
      auto-save-timeout 20   ; number of seconds idle time before auto-save (default: 30)
      auto-save-interval 200 ; number of keystrokes between auto-saves (default: 300)
      )


(when (string-equal system-type "darwin")
  ;; delete files by moving them to the trash
  (setq delete-by-moving-to-trash t)
  (setq trash-directory "~/.Trash")
  ;; Don't make new frames when opening a new file with Emacs
  (setq ns-pop-up-frames nil)
  ;; Use Command-` to switch between Emacs windows (not frames)
  (bind-key "s-`" 'other-window)
)

  ;; Because of the keybindings above, set one for `other-frame'
  ;; (bind-key "s-1" 'other-frame)

  ;; Fullscreen!
  (setq ns-use-native-fullscreen nil) ; Not Lion style
  (bind-key "<s-return>" 'toggle-frame-fullscreen)
```


<a id="org2a5a5ac"></a>

### revert autosaved after breakdown

-   [this stack exchange post](http://emacs.stackexchange.com/questions/3776/how-to-view-diff-when-emacs-suggests-to-recover-this-file) introduce the way running [`diff-buffer-with-file`](diff-buffer-with-file) after `recover-this-file` to see the difference between the autosave batch as compared to the master before system broken down.

```emacs-lisp
(defun odin-diff-buffer-with-file ()
  "Compare the current modified buffer with the saved version."
  (interactive)
  (let ((diff-switches "-u")) ;; unified diff
    (diff-buffer-with-file (current-buffer))))

(global-set-key (kbd "C-/") 'odin-diff-buffer-with-file)
(global-set-key (kbd "C-_") 'ediff-current-file)
```


<a id="org21fce67"></a>

## kill/yank with CUA interaction

-   there was general worry that when I save the text from external program into the system clipboard (external pasting), and then killing the an emacs region before inserting the external text, the text in [the system clipboard will lost. ](http://stackoverflow.com/questions/24196020/how-to-stop-emacs-from-contaminating-the-clipboard)


<a id="org4632fd6"></a>

### the mechanism of this issue

-   there are two systems here, kill/yank system (KY system), with kill ring as the place store content, and CUA system, with system clipboard as place to store the content.
-   By default, text from KY system is able to write into system clipboard, while the reciprocal writing (CUA writing in kill ring) was not active.


<a id="orgf240b58"></a>

### there are two ways to address this issue.

| solutions                                    | to accomplish external pasting      |
| 1. either enable CUA writing in kill ring.   | using C-y and M-y to locate desire. |
| 2. or disable KY written in system clipboard | use a new key binding               |

```emacs-lisp
;; 1, unifying system clipboard and KY kill ring
(setq save-interprogram-paste-before-kill t)

;; 2. sepeate clearly the two system and use a new key binding to it
;;(setq x-select-enable-clipboard nil)
;;(global-set-key (kbd "C-c y") 'x-clipboard-yank)
```
