config.org
** mode-line face                            :MELPA_ori:
#+BEGIN_SRC emacs-lisp
(display-time-mode)



(use-package smart-mode-line
  :ensure t
  :init
  (setq sml/no-confirm-load-theme t)
  (setq sml/theme 'powerline)
  (setq powerline-arrow-shape 'curve)
  (setq powerline-default-separator-dir '(left . right))
  (setq sml/name-width 20)
  (setq sml/mode-width 0)
  (sml/setup) ;;to initiate the sml!!
  :config
  (progn
    (set-face-attribute 'mode-line nil
			:box nil)
    (add-to-list 'sml/replacer-regexp-list '("^~/src/" ":src:") t)))

(use-package diminish
  :ensure t
  :config
  (progn
    (eval-after-load "whitespace" '(diminish 'whitespace-mode))
    (eval-after-load "yasnippet" '(diminish 'yas-minor-mode))
    (eval-after-load "undo-tree" '(diminish 'undo-tree-mode))
    (eval-after-load "guide-key" '(diminish 'guide-key-mode))
    (eval-after-load "smartparens" '(diminish 'smartparens-mode))
    (eval-after-load "guide-key" '(diminish 'guide-key-mode))
    (eval-after-load "eldoc" '(diminish 'eldoc-mode))
    (eval-after-load "flyspell" '(diminish 'fly-spell-mode))
    (diminish 'visual-line-mode)
    ))

;; (use-package org-wc
;;   :ensure org-wc) ;;


;; (custom-set-faces
;;  '(mode-line ((t (:foreground "#030303" :background "#bdbdbd" :box nil))))
;;  '(mode-line-inactive ((t (:foreground "#f9f9f9" :background "#666666" :box nil)))))
#+END_SRC

** guide-key mode                            :MELPA_ori:
#+BEGIN_SRC emacs-lisp
(require 'guide-key)
(setq guide-key/guide-key-sequence t) ;; on for all key-bindings
(guide-key-mode 1)

#+END_SRC

** [[https://github.com/lewang/command-log-mode][command log-mode]]                          :MELPA_ori:
#+BEGIN_SRC
(use-package command-log-mode
  :ensure t)
#+END_SRC
** CANCELED ergoemacs mode
#+BEGIN_SRC
  (use-package ergoemacs-mode
    :ensure t
    :init (progn
	    (setq emacs-theme "lvl1")
	    (ergoemacs-mode 1)))

#+END_SRC
* Files in buffers
** file fast jump
*** key jump
#+begin_src emacs-lisp
(global-set-key (kbd "S-<f10>")
  (lambda ()
    (interactive)
    (dired "/Users/Guoshiyuan/Dropbox/org_files/future")))
(global-set-key (kbd "S-<f12>")
  (lambda ()
    (interactive)
    (find-file "/Users/Guoshiyuan/Dropbox/org_files/antguos_lablog.org")))
(global-set-key (kbd "S-<f11>")
  (lambda ()
    (interactive)
    (find-file "/Users/Guoshiyuan/Dropbox/org_files/tech.org")))
(global-set-key (kbd "S-<f9>")
  (lambda ()
    (interactive)
    (dired "/Users/Guoshiyuan/Desktop/RA_admin/org_anat")))
(global-set-key (kbd "S-<f8>")
  (lambda ()
    (interactive)
    (dired "/Users/Guoshiyuan/Dropbox/org_files/testing_ground")))
(global-set-key (kbd "S-<f7>")
  (lambda ()
    (interactive)
    (find-file "/Users/Guoshiyuan/.emacs.d/config.org")))
(global-set-key (kbd "S-<f6>")
  (lambda ()
    (interactive)
    (dired "/Users/Guoshiyuan/Documents/GRE/Test_preparation/")))
(global-set-key (kbd "S-<f5>")
  (lambda ()
    (interactive)
    (find-file "/Users/Guoshiyuan/Dropbox/org_files/org_life/voca.org")))



#+end_src
*** bm: for book mark                      :MELPA_ori:
#+BEGIN_SRC emacs-lisp
(use-package bm
  :ensure t
  :bind (("C-c =" . bm-toggle)
	 ("C-c [" . bm-previous)
	 ("C-c ]" . bm-next)))
#+END_SRC

** MAC "s-" key
#+BEGIN_SRC emacs-lisp

  ;; Don't make new frames when opening a new file with Emacs
  (setq ns-pop-up-frames nil)
  ;; Use Command-` to switch between Emacs windows (not frames)
  ;; (bind-key "s-`" 'other-window))

  ;; Because of the keybindings above, set one for `other-frame'
  ;; (bind-key "s-1" 'other-frame)

  ;; Fullscreen!
  (setq ns-use-native-fullscreen nil) ; Not Lion style
  (bind-key "<s-return>" 'toggle-frame-fullscreen)

#+END_SRC
** buffer manipulation                      :wolray:
*** switching among[[https://zhuanlan.zhihu.com/p/24017130?refer%3Dghostinemacs][ "meaningful" buffer ]]
- what is definition of meaningful buffer.
- the two variable are [[help:buffer-read-only][buffer-read-only]] and [[help:buffer-file-name][buffer-file-name]].
#+BEGIN_SRC emacs-lisp
;; define the meaning of normal buffer
(defun f-normal-buffer ()
(or (not buffer-read-only)
    (buffer-file-name)))

(defun c-switch-to-next-buffer ()
  (interactive)
  (unless (minibufferp)
    (let ((p t) (bn (buffer-name)))
      (switch-to-next-buffer)
      (while (and p (not (f-normal-buffer)))
	(switch-to-next-buffer)
	(when (string= bn (buffer-name)) (setq p nil))))))

(defun c-switch-to-prev-buffer ()
  (interactive)
  (unless (minibufferp)
    (let ((p t) (bn (buffer-name)))
      (switch-to-prev-buffer)
      (while (and p (not (f-normal-buffer)))
	(switch-to-prev-buffer)
	(when (string= bn (buffer-name)) (setq p nil))))))


;; buffer switching
(bind-key "s-[" 'c-switch-to-next-buffer)
(bind-key "s-]" 'c-switch-to-prev-buffer)
#+END_SRC
*** ibuffer is the improved version of list-buffers.
#+begin_src emacs-lisp
;; make ibuffer the default buffer lister.
(defalias 'list-buffers 'ibuffer)
#+end_src
source: http://ergoemacs.org/emacs/emacs_buffer_management.html
