config.md


<a id="orge387eb9"></a>

## mode-line face     :MELPA_ori:

```emacs-lisp
(display-time-mode)



(use-package smart-mode-line
  :ensure t
  :init
  (setq sml/no-confirm-load-theme t)
  (setq sml/theme 'powerline)
  (setq powerline-arrow-shape 'curve)
  (setq powerline-default-separator-dir '(left . right))
  (setq sml/name-width 20)
  (setq sml/mode-width 0)
  (sml/setup) ;;to initiate the sml!!
  :config
  (progn
    (set-face-attribute 'mode-line nil
			:box nil)
    (add-to-list 'sml/replacer-regexp-list '("^~/src/" ":src:") t)))

(use-package diminish
  :ensure t
  :config
  (progn
    (eval-after-load "whitespace" '(diminish 'whitespace-mode))
    (eval-after-load "yasnippet" '(diminish 'yas-minor-mode))
    (eval-after-load "undo-tree" '(diminish 'undo-tree-mode))
    (eval-after-load "guide-key" '(diminish 'guide-key-mode))
    (eval-after-load "smartparens" '(diminish 'smartparens-mode))
    (eval-after-load "guide-key" '(diminish 'guide-key-mode))
    (eval-after-load "eldoc" '(diminish 'eldoc-mode))
    (eval-after-load "flyspell" '(diminish 'fly-spell-mode))
    (diminish 'visual-line-mode)
    ))

;; (use-package org-wc
;;   :ensure org-wc) ;;


;; (custom-set-faces
;;  '(mode-line ((t (:foreground "#030303" :background "#bdbdbd" :box nil))))
;;  '(mode-line-inactive ((t (:foreground "#f9f9f9" :background "#666666" :box nil)))))
```


<a id="orgd8b9381"></a>

## guide-key mode     :MELPA_ori:

```emacs-lisp
(require 'guide-key)
(setq guide-key/guide-key-sequence t) ;; on for all key-bindings
(guide-key-mode 1)
```


<a id="org52da9fa"></a>

## [command log-mode](https://github.com/lewang/command-log-mode)     :MELPA_ori:

```
(use-package command-log-mode
  :ensure t)
```


<a id="orgfc52319"></a>

## ergoemacs mode

```
  (use-package ergoemacs-mode
    :ensure t
    :init (progn
	    (setq emacs-theme "lvl1")
	    (ergoemacs-mode 1)))
```


<a id="org9a4c409"></a>

# Files in buffers


<a id="org5eae561"></a>

## file fast jump


<a id="org374641f"></a>

### key jump

```emacs-lisp
(global-set-key (kbd "S-<f10>")
  (lambda ()
    (interactive)
    (dired "/Users/Guoshiyuan/Dropbox/org_files/future")))
(global-set-key (kbd "S-<f12>")
  (lambda ()
    (interactive)
    (find-file "/Users/Guoshiyuan/Dropbox/org_files/antguos_lablog.org")))
(global-set-key (kbd "S-<f11>")
  (lambda ()
    (interactive)
    (find-file "/Users/Guoshiyuan/Dropbox/org_files/tech.org")))
(global-set-key (kbd "S-<f9>")
  (lambda ()
    (interactive)
    (dired "/Users/Guoshiyuan/Desktop/RA_admin/org_anat")))
(global-set-key (kbd "S-<f8>")
  (lambda ()
    (interactive)
    (dired "/Users/Guoshiyuan/Dropbox/org_files/testing_ground")))
(global-set-key (kbd "S-<f7>")
  (lambda ()
    (interactive)
    (find-file "/Users/Guoshiyuan/.emacs.d/config.org")))
(global-set-key (kbd "S-<f6>")
  (lambda ()
    (interactive)
    (dired "/Users/Guoshiyuan/Documents/GRE/Test_preparation/")))
(global-set-key (kbd "S-<f5>")
  (lambda ()
    (interactive)
    (find-file "/Users/Guoshiyuan/Dropbox/org_files/org_life/voca.org")))
```


<a id="orgd892085"></a>

### bm: for book mark     :MELPA_ori:

```emacs-lisp
(use-package bm
  :ensure t
  :bind (("C-c =" . bm-toggle)
	 ("C-c [" . bm-previous)
	 ("C-c ]" . bm-next)))
```


<a id="orga861a60"></a>

## MAC "s-" key

```emacs-lisp
  ;; Don't make new frames when opening a new file with Emacs
  (setq ns-pop-up-frames nil)
  ;; Use Command-` to switch between Emacs windows (not frames)
  ;; (bind-key "s-`" 'other-window))

  ;; Because of the keybindings above, set one for `other-frame'
  ;; (bind-key "s-1" 'other-frame)

  ;; Fullscreen!
  (setq ns-use-native-fullscreen nil) ; Not Lion style
  (bind-key "<s-return>" 'toggle-frame-fullscreen)
```


<a id="org9ccf1ad"></a>

## buffer manipulation     :wolray:


<a id="org6b9d5fc"></a>

### switching among[ "meaningful" buffer ](https://zhuanlan.zhihu.com/p/24017130?refer%3Dghostinemacs)

-   what is definition of meaningful buffer.
-   the two variable are [buffer-read-only](buffer-read-only) and [buffer-file-name](buffer-file-name).

```emacs-lisp
;; define the meaning of normal buffer
(defun f-normal-buffer ()
(or (not buffer-read-only)
    (buffer-file-name)))

(defun c-switch-to-next-buffer ()
  (interactive)
  (unless (minibufferp)
    (let ((p t) (bn (buffer-name)))
      (switch-to-next-buffer)
      (while (and p (not (f-normal-buffer)))
	(switch-to-next-buffer)
	(when (string= bn (buffer-name)) (setq p nil))))))

(defun c-switch-to-prev-buffer ()
  (interactive)
  (unless (minibufferp)
    (let ((p t) (bn (buffer-name)))
      (switch-to-prev-buffer)
      (while (and p (not (f-normal-buffer)))
	(switch-to-prev-buffer)
	(when (string= bn (buffer-name)) (setq p nil))))))


;; buffer switching
(bind-key "s-[" 'c-switch-to-next-buffer)
(bind-key "s-]" 'c-switch-to-prev-buffer)
```


<a id="org7a8cb70"></a>

### ibuffer is the improved version of list-buffers.

```emacs-lisp
;; make ibuffer the default buffer lister.
(defalias 'list-buffers 'ibuffer)
```

source: <http://ergoemacs.org/emacs/emacs_buffer_management.html>
