config.org
*** toggle window view [[http://stackoverflow.com/questions/14881020/emacs-shortcut-to-switch-from-a-horizontal-split-to-a-vertical-split-in-one-move][from horizontal split to vertical split]]

#+BEGIN_SRC emacs-lisp
(defun toggle-window-split ()
  (interactive)
  (if (= (count-windows) 2)
      (let* ((this-win-buffer (window-buffer))
	     (next-win-buffer (window-buffer (next-window)))
	     (this-win-edges (window-edges (selected-window)))
	     (next-win-edges (window-edges (next-window)))
	     (this-win-2nd (not (and (<= (car this-win-edges)
					 (car next-win-edges))
				     (<= (cadr this-win-edges)
					 (cadr next-win-edges)))))
	     (splitter
	      (if (= (car this-win-edges)
		     (car (window-edges (next-window))))
		  'split-window-horizontally
		'split-window-vertically)))
	(delete-other-windows)
	(let ((first-win (selected-window)))
	  (funcall splitter)
	  (if this-win-2nd (other-window 1))
	  (set-window-buffer (selected-window) this-win-buffer)
	  (set-window-buffer (next-window) next-win-buffer)
	  (select-window first-win)
	  (if this-win-2nd (other-window 1))))))

(global-set-key (kbd "C-x |") 'toggle-window-split)

#+END_SRC
** TODO dired file managment
#+BEGIN_SRC emacs-lisp
  (setq ls-lisp-use-insert-directory-program nil)
  (require 'ls-lisp)

#+END_SRC
*** auto-revert mode
#+begin_src emacs-lisp
(add-hook 'dired-mode-hook 'auto-revert-mode)

;; Also auto refresh dired, but be quiet about it
(setq global-auto-revert-non-file-buffers t)
(setq auto-revert-verbose nil)
#+end_src
source: [[http://whattheemacsd.com/sane-defaults.el-01.html][Magnars Sveen]]
** TODO Recentf
#+BEGIN_SRC emacs-lisp
(recentf-mode 1)
(setq recentf-max-saved-items 200
      recentf-max-menu-items 15)
(setq inhibit-startup-message t)
#+END_SRC
*** minibuffer [[file:~/Dropbox/org_files/org_life/emacs-history][history]]
#+BEGIN_SRC emacs-lisp
(setq savehist-file "/Users/Guoshiyuan/Dropbox/org_files/org_life/emacs-history")
(savehist-mode 1)

#+END_SRC

** External link using default apps.
- i thought this is an emacs problem; therefore I dig into the code from [[http://emacs.stackexchange.com/questions/3105/how-to-use-an-external-program-as-the-default-way-to-open-pdfs-from-emacs][using terminal default app]] and [[http://ergoemacs.org/emacs/emacs_dired_open_file_in_ext_apps.html][openwith package]]. I did not think carefully that this problem is actually an org-mode related problem
  - I keep on testing file link in org mode, and the link (the [[http://stackoverflow.com/questions/3973896/emacs-org-mode-file-viewer-associations][URL-like link]]) is folded in org mode syntax.
- this is the [[https://dontomp.wordpress.com/2015/01/31/in-org-mode-have-the-default-program-openoffice-word-or-whatever-open-docx-file-links/][link]] to addressing the issue.
  - not quite sure about the extention syntax and meaning of single quote after it. //is that regular expression

#+BEGIN_SRC emacs-lisp
(setq org-file-apps
      '(("\\.docx\\'" . default)
        ("\\.doc\\'" . default)
	("\\.xlsx\\'" . default)
	("\\.png\\'" . default)
	("\\.tif\\'" . default)
	("\\.tiff\\'" . default)
	("\\.pdf\\'" . default)
	(auto-mode . emacs)))
#+END_SRC

*** open pdf using emacs internal packages, docview
#+BEGIN_SRC
(use-package doc-view
  :commands doc-view-mode
  :config
  (define-key doc-view-mode-map (kbd "<right>") 'doc-view-next-page)
  (define-key doc-view-mode-map (kbd "<left>") 'doc-view-previous-page))

#+END_SRC

* Selection and completion
- how helm+swoop complement task with ivy+counsel+swiper
- a list of function
  + M-x
  + C-x C-f
  + C-h v/f
|----------------------+-----------------------------+------------------|
| packages&            | description                 | task it complish |
|----------------------+-----------------------------+------------------|
| [[https://github.com/emacs-helm/helm][helm]]                 |                             | flyspell,        |
| - helm-projectile    |                             |                  |
| - helm-ag            |                             |                  |
| - helm-swoop         |                             |                  |
|----------------------+-----------------------------+------------------|
| [[http://oremacs.com/swiper/][ivy]] @ abo-abo        | generic list pick           | searching        |
| - hydra              | C-o to initiate *fast key*  |                  |
| - counsel            |                             |                  |
| - councel-[[http://projectile.readthedocs.io/en/latest/][projectile]] | project interaction library |                  |
| - swiper             | alt to isearch,             |                  |
|----------------------+-----------------------------+------------------|
| [[https://github.com/abo-abo/ace-window][ace-window]] @ abo-abo |                             |                  |
|----------------------+-----------------------------+------------------|
| [[https://github.com/abo-abo/ace-link][ace-link]] @ abo-abo   |                             |                  |
|----------------------+-----------------------------+------------------|
| [[https://github.com/abo-abo/avy][avy]] Vs [[https://github.com/winterTTr/ace-jump-mode][ace-jump-mode]] |                             |                  |
|----------------------+-----------------------------+------------------|
| popup                |                             |                  |
| - ess-R-object-popup |                             |                  |
|----------------------+-----------------------------+------------------|
| [[http://company-mode.github.io][company]]              | technical completion        |                  |
| - shell              | shell backend               |                  |




