config.md


<a id="org3f9c4fe"></a>

### toggle window view [from horizontal split to vertical split](http://stackoverflow.com/questions/14881020/emacs-shortcut-to-switch-from-a-horizontal-split-to-a-vertical-split-in-one-move)

```emacs-lisp
(defun toggle-window-split ()
  (interactive)
  (if (= (count-windows) 2)
      (let* ((this-win-buffer (window-buffer))
	     (next-win-buffer (window-buffer (next-window)))
	     (this-win-edges (window-edges (selected-window)))
	     (next-win-edges (window-edges (next-window)))
	     (this-win-2nd (not (and (<= (car this-win-edges)
					 (car next-win-edges))
				     (<= (cadr this-win-edges)
					 (cadr next-win-edges)))))
	     (splitter
	      (if (= (car this-win-edges)
		     (car (window-edges (next-window))))
		  'split-window-horizontally
		'split-window-vertically)))
	(delete-other-windows)
	(let ((first-win (selected-window)))
	  (funcall splitter)
	  (if this-win-2nd (other-window 1))
	  (set-window-buffer (selected-window) this-win-buffer)
	  (set-window-buffer (next-window) next-win-buffer)
	  (select-window first-win)
	  (if this-win-2nd (other-window 1))))))

(global-set-key (kbd "C-x |") 'toggle-window-split)
```


<a id="org25f5fb3"></a>

## dired file managment

```emacs-lisp
  (setq ls-lisp-use-insert-directory-program nil)
  (require 'ls-lisp)
```


<a id="org5c3c8b3"></a>

### auto-revert mode

```emacs-lisp
(add-hook 'dired-mode-hook 'auto-revert-mode)

;; Also auto refresh dired, but be quiet about it
(setq global-auto-revert-non-file-buffers t)
(setq auto-revert-verbose nil)
```

source: [Magnars Sveen](http://whattheemacsd.com/sane-defaults.el-01.html)


<a id="org11d287b"></a>

## Recentf

```emacs-lisp
(recentf-mode 1)
(setq recentf-max-saved-items 200
      recentf-max-menu-items 15)
(setq inhibit-startup-message t)
```


<a id="org3896e78"></a>

### minibuffer [history](file:///Users/Guoshiyuan/Dropbox/org_files/org_life/emacs-history)

```emacs-lisp
(setq savehist-file "/Users/Guoshiyuan/Dropbox/org_files/org_life/emacs-history")
(savehist-mode 1)
```


<a id="orgdb4ffd1"></a>

## External link using default apps.

-   i thought this is an emacs problem; therefore I dig into the code from [using terminal default app](http://emacs.stackexchange.com/questions/3105/how-to-use-an-external-program-as-the-default-way-to-open-pdfs-from-emacs) and [openwith package](http://ergoemacs.org/emacs/emacs_dired_open_file_in_ext_apps.html). I did not think carefully that this problem is actually an org-mode related problem
    -   I keep on testing file link in org mode, and the link (the [URL-like link](http://stackoverflow.com/questions/3973896/emacs-org-mode-file-viewer-associations)) is folded in org mode syntax.
-   this is the [link](https://dontomp.wordpress.com/2015/01/31/in-org-mode-have-the-default-program-openoffice-word-or-whatever-open-docx-file-links/) to addressing the issue.
    -   not quite sure about the extention syntax and meaning of single quote after it. //is that regular expression

```emacs-lisp
(setq org-file-apps
      '(("\\.docx\\'" . default)
        ("\\.doc\\'" . default)
	("\\.xlsx\\'" . default)
	("\\.png\\'" . default)
	("\\.tif\\'" . default)
	("\\.tiff\\'" . default)
	("\\.pdf\\'" . default)
	(auto-mode . emacs)))
```


<a id="org02c87a6"></a>

### open pdf using emacs internal packages, docview

```
(use-package doc-view
  :commands doc-view-mode
  :config
  (define-key doc-view-mode-map (kbd "<right>") 'doc-view-next-page)
  (define-key doc-view-mode-map (kbd "<left>") 'doc-view-previous-page))
```


<a id="org4d0ae91"></a>

# Selection and completion

-   how helm+swoop complement task with ivy+counsel+swiper
-   a list of function
    -   M-x
    -   C-x C-f
    -   C-h v/f

| packages&                                                                                            | description                  | task it complish |
| [helm](https://github.com/emacs-helm/helm)                                                           |                              | flyspell,        |
| - helm-projectile                                                                                    |                              |                  |
| - helm-ag                                                                                            |                              |                  |
| - helm-swoop                                                                                         |                              |                  |
| [ivy](http://oremacs.com/swiper/) @ abo-abo                                                          | generic list pick            | searching        |
| - hydra                                                                                              | C-o to initiate **fast key** |                  |
| - counsel                                                                                            |                              |                  |
| - councel-[projectile](http://projectile.readthedocs.io/en/latest/)                                  | project interaction library  |                  |
| - swiper                                                                                             | alt to isearch,              |                  |
| [ace-window](https://github.com/abo-abo/ace-window) @ abo-abo                                        |                              |                  |
| [ace-link](https://github.com/abo-abo/ace-link) @ abo-abo                                            |                              |                  |
| [avy](https://github.com/abo-abo/avy) Vs [ace-jump-mode](https://github.com/winterTTr/ace-jump-mode) |                              |                  |
| popup                                                                                                |                              |                  |
| - ess-R-object-popup                                                                                 |                              |                  |
| [company](http://company-mode.github.io)                                                             | technical completion         |                  |
| - shell                                                                                              | shell backend                |                  |
