config.org
** ivy-hydra for switching buffer            :MELPA_ori:
#+BEGIN_SRC emacs-lisp
 (use-package counsel
   :ensure t
   :bind
   (("M-x" . counsel-M-x)
    ("M-y" . counsel-yank-pop)
    :map ivy-minibuffer-map
    ("M-y" . ivy-next-line)))

  (use-package swiper
    :diminish ivy-mode
    :ensure t
    :bind*
    (("C-s" . swiper)
     ("C-r" . ivy-resume) ;; original C-c C-r overide with ess send region. 
     ("C-x C-f" . counsel-find-file)
     ("C-c h f" . counsel-describe-function)
     ("C-c h v" . counsel-describe-variable)
     ("C-c i u" . counsel-unicode-char)
     ("M-i" . counsel-imenu)
     ("C-c g" . counsel-git)
     ("C-c j" . counsel-git-grep)
     ("C-c k" . counsel-ag)
     ("C-c i u" . counsel-locate))
    :config
    (progn
      (ivy-mode 1)
      (setq ivy-use-virtual-buffers t)
      (define-key read-expression-map (kbd "C-r") #'counsel-expression-history)
      (ivy-set-actions
	'counsel-find-file
	'(("d" (lambda (x) (delete-file (expand-file-name x)))
	  "delete"
	  )))
      (ivy-set-actions
	'ivy-switch-buffer
	'(("k"
	  (lambda (x)
	    (kill-buffer x)
	    (ivy--reset-state ivy-last))
	  "kill")
	 ("j"
	  ivy--switch-buffer-other-window-action
	  "other window")))))

 (use-package counsel-projectile
   :ensure t
   :config
   (counsel-projectile-on))

 (use-package ivy-hydra :ensure t)
#+END_SRC


** flyspell using ivy                       :MELPA_ori:
- [[http://blog.binchen.org/posts/what-s-the-best-spell-check-set-up-in-emacs.html][the strength and weekness of using aspell and hunspell.]]
#+BEGIN_SRC emacs-lisp
(setq flyspell-use-meta-tab nil)

(use-package flyspell-correct-ivy
  :bind (:map flyspell-mode-map
	      ("C-;" . flyspell-correct-word-generic)))

;;(require 'flyspell-correct-helm)
;;(define-key flyspell-mode-map (kbd "C-;") 'flyspell-correct-previous-word-generic)
#+END_SRC
** avy
#+BEGIN_SRC emacs-lisp
(use-package avy
  :bind
  (:map dired-mode-map ("." . avy-goto-word-or-subword-1))
  :config
  (avy-setup-default))
#+END_SRC
** ace link
- [[https://github.com/waymondo/hemacs/blob/master/init.el][waymondo]]
#+BEGIN_SRC emacs-lisp
(use-package ace-link
  :bind
  ("M-g e" . avy-jump-error)
  :config
  (ace-link-setup-default)
  (defun avy-jump-error-next-error-hook ()
    (let ((compilation-buffer (compilation-find-buffer)))
      (quit-window nil (get-buffer-window compilation-buffer))
      (recenter)))
  (def avy-jump-error
    (let ((compilation-buffer (compilation-find-buffer))
	  (next-error-hook '(avy-jump-error-next-error-hook)))
      (when compilation-buffer
	(with-current-buffer compilation-buffer
	  (when (derived-mode-p 'compilation-mode)
	    (pop-to-buffer compilation-buffer)
	    (ace-link-compilation)))))))
#+END_SRC
** ace window
- [[https://github.com/waymondo/hemacs/blob/master/init.el][waymondo]]
#+BEGIN_SRC emacs-lisp
(use-package ace-window
  :ensure t
  :bind  ("s-`" . ace-window)
  :config
  (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
  :init
  (progn
    (global-set-key [remap other-window] 'ace-window)
					;(setq aw-scope 'frame)
    (custom-set-faces
     '(aw-leading-char-face
       ((t (:inherit ace-jump-face-foreground :height 3.0)))))
))
#+END_SRC
** CANCELED ace-jump-mode
#+BEGIN_SRC
(use-package ace-jump-mode
  :ensure t
  :bind ("C--" . ace-jump-mode))
#+END_SRC
** CANCELED Helm                            :MELPA_ori:
- [[http://emacs.readthedocs.io/en/latest/completion_and_selection.html][helm and multiple cursor interaction]].
#+begin_src
(use-package helm
  :ensure t
  :diminish helm-mode
  :init (progn
	  (require 'helm-config)
	  (use-package helm-projectile
	    :ensure t
	    :commands helm-projectile
	    :bind ("C-c p h" . helm-projectile))
	  (use-package helm-ag :defer 10  :ensure t)
	  (setq helm-locate-command "mdfind -interpret -name %s %s"
		helm-ff-newfile-prompt-p nil
		helm-M-x-fuzzy-match t
		helm-buffers-fuzzy-matching t
		helm-recentf-fuzzy-match t
		helm-apropos-fuzzy-match t
		helm-semantic-fuzzy-match t
		helm-imenu-fuzzy-match t)
	  (helm-mode)
	  (use-package helm-swoop
	    :ensure t
	    :bind ("C-M-z" . helm-swoop)
	    :init (progn
		    (setq helm-multi-swoop-edit-save t
			  ))))
  :bind (("C-c h" . helm-command-prefix)
	 ("C-x b" . helm-mini)
	 ("C-`" . helm-resume)
	 ("M-x" . helm-M-x)
	 ("C-x C-f" . helm-find-files)
	 ("C-h a" . helm-apropos)
	 ("C-c h o" . helm-occur)))



#+end_src
** CANCELED Ido                             :MELPA_ori:

#+begin_src
(use-package ido
  :init
  (setq ido-enable-flex-matching t)
  (setq ido-everywhere t)
  (ido-mode t)
  (use-package ido-vertical-mode
    :ensure t
    :defer t
    :init (ido-vertical-mode 1)
    (setq ido-vertical-define-keys 'C-n-and-C-p-only)))
#+end_src





* Generic document edit
** Parenthesis
*** show parenthesis
#+BEGIN_SRC emacs-lisp
(show-paren-mode t)

(use-package highlight-parentheses
  :ensure t
  :diminish highlight-parentheses-mode
  :config
  (add-hook 'emacs-lisp-mode-hook
	    (lambda()
	      (highlight-parentheses-mode)
	      )))

(use-package rainbow-delimiters
  :ensure t
  :config
  (add-hook 'lisp-mode-hook
	    (lambda()
	      (rainbow-delimiters-mode)
	      ))
  :init (global-highlight-parentheses-mode)
  )


#+END_SRC
