config.md


<a id="org96279d7"></a>

## ivy-hydra for switching buffer     :MELPA_ori:

```emacs-lisp
 (use-package counsel
   :ensure t
   :bind
   (("M-x" . counsel-M-x)
    ("M-y" . counsel-yank-pop)
    :map ivy-minibuffer-map
    ("M-y" . ivy-next-line)))

  (use-package swiper
    :diminish ivy-mode
    :ensure t
    :bind*
    (("C-s" . swiper)
     ("C-r" . ivy-resume) ;; original C-c C-r overide with ess send region. 
     ("C-x C-f" . counsel-find-file)
     ("C-c h f" . counsel-describe-function)
     ("C-c h v" . counsel-describe-variable)
     ("C-c i u" . counsel-unicode-char)
     ("M-i" . counsel-imenu)
     ("C-c g" . counsel-git)
     ("C-c j" . counsel-git-grep)
     ("C-c k" . counsel-ag)
     ("C-c i u" . counsel-locate))
    :config
    (progn
      (ivy-mode 1)
      (setq ivy-use-virtual-buffers t)
      (define-key read-expression-map (kbd "C-r") #'counsel-expression-history)
      (ivy-set-actions
	'counsel-find-file
	'(("d" (lambda (x) (delete-file (expand-file-name x)))
	  "delete"
	  )))
      (ivy-set-actions
	'ivy-switch-buffer
	'(("k"
	  (lambda (x)
	    (kill-buffer x)
	    (ivy--reset-state ivy-last))
	  "kill")
	 ("j"
	  ivy--switch-buffer-other-window-action
	  "other window")))))

 (use-package counsel-projectile
   :ensure t
   :config
   (counsel-projectile-on))

 (use-package ivy-hydra :ensure t)
```


<a id="orgf01956c"></a>

## flyspell using ivy     :MELPA_ori:

-   [the strength and weekness of using aspell and hunspell.](http://blog.binchen.org/posts/what-s-the-best-spell-check-set-up-in-emacs.html)

```emacs-lisp
(setq flyspell-use-meta-tab nil)

(use-package flyspell-correct-ivy
  :bind (:map flyspell-mode-map
	      ("C-;" . flyspell-correct-word-generic)))

;;(require 'flyspell-correct-helm)
;;(define-key flyspell-mode-map (kbd "C-;") 'flyspell-correct-previous-word-generic)
```


<a id="org188f8b6"></a>

## avy

```emacs-lisp
(use-package avy
  :bind
  (:map dired-mode-map ("." . avy-goto-word-or-subword-1))
  :config
  (avy-setup-default))
```


<a id="org135c80d"></a>

## ace link

-   [waymondo](https://github.com/waymondo/hemacs/blob/master/init.el)

```emacs-lisp
(use-package ace-link
  :bind
  ("M-g e" . avy-jump-error)
  :config
  (ace-link-setup-default)
  (defun avy-jump-error-next-error-hook ()
    (let ((compilation-buffer (compilation-find-buffer)))
      (quit-window nil (get-buffer-window compilation-buffer))
      (recenter)))
  (def avy-jump-error
    (let ((compilation-buffer (compilation-find-buffer))
	  (next-error-hook '(avy-jump-error-next-error-hook)))
      (when compilation-buffer
	(with-current-buffer compilation-buffer
	  (when (derived-mode-p 'compilation-mode)
	    (pop-to-buffer compilation-buffer)
	    (ace-link-compilation)))))))
```


<a id="orgd23b343"></a>

## ace window

-   [waymondo](https://github.com/waymondo/hemacs/blob/master/init.el)

```emacs-lisp
(use-package ace-window
  :ensure t
  :bind  ("s-`" . ace-window)
  :config
  (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
  :init
  (progn
    (global-set-key [remap other-window] 'ace-window)
					;(setq aw-scope 'frame)
    (custom-set-faces
     '(aw-leading-char-face
       ((t (:inherit ace-jump-face-foreground :height 3.0)))))
))
```


<a id="orga601633"></a>

## ace-jump-mode

```
(use-package ace-jump-mode
  :ensure t
  :bind ("C--" . ace-jump-mode))
```


<a id="orgc6395b7"></a>

## Helm     :MELPA_ori:

-   [helm and multiple cursor interaction](http://emacs.readthedocs.io/en/latest/completion_and_selection.html).

```
(use-package helm
  :ensure t
  :diminish helm-mode
  :init (progn
	  (require 'helm-config)
	  (use-package helm-projectile
	    :ensure t
	    :commands helm-projectile
	    :bind ("C-c p h" . helm-projectile))
	  (use-package helm-ag :defer 10  :ensure t)
	  (setq helm-locate-command "mdfind -interpret -name %s %s"
		helm-ff-newfile-prompt-p nil
		helm-M-x-fuzzy-match t
		helm-buffers-fuzzy-matching t
		helm-recentf-fuzzy-match t
		helm-apropos-fuzzy-match t
		helm-semantic-fuzzy-match t
		helm-imenu-fuzzy-match t)
	  (helm-mode)
	  (use-package helm-swoop
	    :ensure t
	    :bind ("C-M-z" . helm-swoop)
	    :init (progn
		    (setq helm-multi-swoop-edit-save t
			  ))))
  :bind (("C-c h" . helm-command-prefix)
	 ("C-x b" . helm-mini)
	 ("C-`" . helm-resume)
	 ("M-x" . helm-M-x)
	 ("C-x C-f" . helm-find-files)
	 ("C-h a" . helm-apropos)
	 ("C-c h o" . helm-occur)))
```


<a id="org77417ad"></a>

## Ido     :MELPA_ori:

```
(use-package ido
  :init
  (setq ido-enable-flex-matching t)
  (setq ido-everywhere t)
  (ido-mode t)
  (use-package ido-vertical-mode
    :ensure t
    :defer t
    :init (ido-vertical-mode 1)
    (setq ido-vertical-define-keys 'C-n-and-C-p-only)))
```


<a id="orgb1f9f90"></a>

# Generic document edit


<a id="org26c40c5"></a>

## Parenthesis


<a id="org75b553f"></a>

### show parenthesis

```emacs-lisp
(show-paren-mode t)

(use-package highlight-parentheses
  :ensure t
  :diminish highlight-parentheses-mode
  :config
  (add-hook 'emacs-lisp-mode-hook
	    (lambda()
	      (highlight-parentheses-mode)
	      )))

(use-package rainbow-delimiters
  :ensure t
  :config
  (add-hook 'lisp-mode-hook
	    (lambda()
	      (rainbow-delimiters-mode)
	      ))
  :init (global-highlight-parentheses-mode)
  )
```
