config.el

(use-package counsel
  :ensure t
  :bind
  (("M-x" . counsel-M-x)
   ("M-y" . counsel-yank-pop)
   :map ivy-minibuffer-map
   ("M-y" . ivy-next-line)))

 (use-package swiper
   :diminish ivy-mode
   :ensure t
   :bind*
   (("C-s" . swiper)
    ("C-r" . ivy-resume) ;; original C-c C-r overide with ess send region. 
    ("C-x C-f" . counsel-find-file)
    ("C-c h f" . counsel-describe-function)
    ("C-c h v" . counsel-describe-variable)
    ("C-c i u" . counsel-unicode-char)
    ("M-i" . counsel-imenu)
    ("C-c g" . counsel-git)
    ("C-c j" . counsel-git-grep)
    ("C-c k" . counsel-ag)
    ("C-c i u" . counsel-locate))
   :config
   (progn
     (ivy-mode 1)
     (setq ivy-use-virtual-buffers t)
     (define-key read-expression-map (kbd "C-r") #'counsel-expression-history)
     (ivy-set-actions
       'counsel-find-file
       '(("d" (lambda (x) (delete-file (expand-file-name x)))
	 "delete"
	 )))
     (ivy-set-actions
       'ivy-switch-buffer
       '(("k"
	 (lambda (x)
	   (kill-buffer x)
	   (ivy--reset-state ivy-last))
	 "kill")
	("j"
	 ivy--switch-buffer-other-window-action
	 "other window")))))

(use-package counsel-projectile
  :ensure t
  :config
  (counsel-projectile-on))

(use-package ivy-hydra :ensure t)

(setq flyspell-use-meta-tab nil)

(use-package flyspell-correct-ivy
  :bind (:map flyspell-mode-map
	      ("C-;" . flyspell-correct-word-generic)))

;;(require 'flyspell-correct-helm)
;;(define-key flyspell-mode-map (kbd "C-;") 'flyspell-correct-previous-word-generic)

(use-package avy
  :bind
  (:map dired-mode-map ("." . avy-goto-word-or-subword-1))
  :config
  (avy-setup-default))

(use-package ace-link
  :bind
  ("M-g e" . avy-jump-error)
  :config
  (ace-link-setup-default)
  (defun avy-jump-error-next-error-hook ()
    (let ((compilation-buffer (compilation-find-buffer)))
      (quit-window nil (get-buffer-window compilation-buffer))
      (recenter)))
  (def avy-jump-error
    (let ((compilation-buffer (compilation-find-buffer))
	  (next-error-hook '(avy-jump-error-next-error-hook)))
      (when compilation-buffer
	(with-current-buffer compilation-buffer
	  (when (derived-mode-p 'compilation-mode)
	    (pop-to-buffer compilation-buffer)
	    (ace-link-compilation)))))))

(use-package ace-window
  :ensure t
  :bind  ("s-`" . ace-window)
  :config
  (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
  :init
  (progn
    (global-set-key [remap other-window] 'ace-window)
					;(setq aw-scope 'frame)
    (custom-set-faces
     '(aw-leading-char-face
       ((t (:inherit ace-jump-face-foreground :height 3.0)))))
))

(show-paren-mode t)

(use-package highlight-parentheses
  :ensure t
  :diminish highlight-parentheses-mode
  :config
  (add-hook 'emacs-lisp-mode-hook
	    (lambda()
	      (highlight-parentheses-mode)
	      )))

(use-package rainbow-delimiters
  :ensure t
  :config
  (add-hook 'lisp-mode-hook
	    (lambda()
	      (rainbow-delimiters-mode)
	      ))
  :init (global-highlight-parentheses-mode)
  )
