config.org
*** add parenthesis
|-----------------------+-----------------------------------------+----------------------------------|
|                       | requirements                            | strategy/mechanism               |
|-----------------------+-----------------------------------------+----------------------------------|
| in text (org)         | post-word highlight ()                  | wrapping outside of the previous |
|                       | preset wrapper (=, ~, _, +), except "*" | expand region                    |
| in program mode (ess) | post-word highlight                     |                                  |
|                       |                                         |                                  |










#+BEGIN_SRC emacs-lisp
(smartparens-global-mode 1)
(sp-pair "(" ")" :wrap "C-(")
;; |foobar
;; hit C-(
;; becomes (|foobar)
(sp-pair "'" nil :actions :rem)

;; (sp-local-pair 'org-mode "=" "=") ; select region, hit = then region -> =region= in org-mode
;; (sp-local-pair 'org-mode "*" "*") ; select region, hit * then region -> *region* in org-mode
;;(sp-local-pair 'org-mode "/" "/") ; select region, hit / then region -> /region/ in org-mode
;; (sp-local-pair 'org-mode "_" "_") ; select region, hit _ then region -> _region_ in org-mode
;; (sp-local-pair 'org-mode "+" "+") ; select region, hit + then region -> +region+ in org-mode
 #+END_SRC
**** TODO this is troublesome for normal org documentation.
- inserting formula in orgtable, ":=" gives a double equal sign
- inserting org header give a double **...
- the best thing is to only apply with highlighted region, which is activated by =expand resion=.
- a [[http://stackoverflow.com/questions/2951797/wrapping-selecting-text-in-enclosing-characters-in-emacs%5D%5D][post]]
*** paredit                                  :MELPA_ori:
**** by jwiegley's [[https://github.com/jwiegley/dot-emacs/blob/e65069d6c715b6eba5d6543ff5897643c92b7625/init.el][init.el]] and self-defined_[[https://github.com/jwiegley/dot-emacs/blob/f23993cfcb9ca90c289b4214b9bafbf46883bdb4/lisp/paredit-ext.el][parendit-ext.el]], there are following functions
-


#+BEGIN_SRC emacs-lisp
(use-package paredit
  :ensure t
  :diminish paredit-mode
  :config
  (add-hook 'emacs-lisp-mode-hook       #'enable-paredit-mode)
  (add-hook 'eval-expression-minibuffer-setup-hook #'enable-paredit-mode)
  (add-hook 'ielm-mode-hook             #'enable-paredit-mode)
  (add-hook 'lisp-mode-hook             #'enable-paredit-mode)
  (add-hook 'lisp-interaction-mode-hook #'enable-paredit-mode)
  (add-hook 'scheme-mode-hook           #'enable-paredit-mode)
  :bind (("C-c d" . paredit-forward-down))
  )

;; Ensure paredit is used EVERYWHERE!
(use-package paredit-everywhere
  :ensure t
  :diminish paredit-everywhere-mode
  :config
  (add-hook 'prog-mode-hook #'paredit-everywhere-mode))


#+END_SRC

** expand region
#+BEGIN_SRC emacs-lisp
(use-package expand-region
  :ensure t
  :bind ("C-=" . er/expand-region))
#+END_SRC

** TODO multiple cursor
*** [[http://emacs.stackexchange.com/questions/751/fundamentals-of-multiple-cursors][fundamental use of multiple cursor]]
*** mc usage @ [[http://pragmaticemacs.com/emacs/multiple-cursors/][pragmatics emacs]]
#+BEGIN_SRC emacs-lisp
;;kaushalmodi
(use-package multiple-cursors
  :bind (("C-S-c C-S-c" . mc/edit-lines)
	 ("C->" . mc/mark-next-like-this)
	 ("C-<" . mc/mark-previous-like-this)
	 ("C-c C-<" . mc/mark-all-like-this)
	 ("C-S-<mouse-1>" . mc/add-cursor-on-click))
  ;; :bind (:map region-bindings-mode-map
  ;;	      ("a" . mc/mark-all-like-this)
  ;;	      ("p" . mc/mark-previous-like-this)
  ;;	      ("n" . mc/mark-next-like-this)
  ;;	      ("P" . mc/unmark-previous-like-this)
  ;;	      ("N" . mc/unmark-next-like-this)
  ;;	      ("[" . mc/cycle-backward)
  ;;	      ("]" . mc/cycle-forward)
  ;;	      ("m" . mc/mark-more-like-this-extended)
  ;;	      ("h" . mc-hide-unmatched-lines-mode)
  ;;	      ("\\" . mc/vertical-align-with-space)
  ;;	      ("#" . mc/insert-numbers) ; use num prefix to set the starting number
  ;;	      ("^" . mc/edit-beginnings-of-lines)
  ;;	      ("$" . mc/edit-ends-of-lines))
  :init
  (progn
    (setq mc/list-file (locate-user-emacs-file "mc-lists"))
    ;; Disable the annoying sluggish matching paren blinks for all cursors
    ;; when you happen to type a ")" or "}" at all cursor locations.
    (defvar modi/mc-blink-matching-paren--store nil
      "Internal variable used to restore the value of `blink-matching-paren'
after `multiple-cursors-mode' is quit.")

    ;; The `multiple-cursors-mode-enabled-hook' and
    ;; `multiple-cursors-mode-disabled-hook' are run in the
    ;; `multiple-cursors-mode' minor mode definition, but they are not declared
    ;; (not `defvar'd). So do that first before using `add-hook'.
    (defvar multiple-cursors-mode-enabled-hook nil
      "Hook that is run after `multiple-cursors-mode' is enabled.")
    (defvar multiple-cursors-mode-disabled-hook nil
      "Hook that is run after `multiple-cursors-mode' is disabled.")

    (defun modi/mc-when-enabled ()
      "Function to be added to `multiple-cursors-mode-enabled-hook'."
      (setq modi/mc-blink-matching-paren--store blink-matching-paren)
      (setq blink-matching-paren nil))

    (defun modi/mc-when-disabled ()
      "Function to be added to `multiple-cursors-mode-disabled-hook'."
      (setq blink-matching-paren modi/mc-blink-matching-paren--store))

    (add-hook 'multiple-cursors-mode-enabled-hook #'modi/mc-when-enabled)
    (add-hook 'multiple-cursors-mode-disabled-hook #'modi/mc-when-disabled)))



;; (require 'multiple-cursors)
;; (global-set-key (kbd "C-S-<right>") 'mc/mark-next-like-this)
;; (global-set-key (kbd "C-S-<left>") 'mc/mark-previous-like-this)
#+END_SRC
