config.org
** CANCELED global abbrev
#+BEGIN_SRC
;; * Autoformat mode in org-mode

(defcustom scimax-autoformat-ordinals t
  "Determines if scimax autoformats ordinal numbers."
  :group 'scimax)

(defun scimax-org-autoformat-ordinals ()
  "Expand ordinal words to superscripted versions in org-mode.
1st to 1^{st}.
2nd to 2^{nd}
3rd to 3^{rd}
4th to 4^{th}"
  (interactive)
  (when (and scimax-autoformat-ordinals
	     (eq major-mode 'org-mode)
	     (not (org-in-src-block-p))
	     (looking-back "\\(?3:\\<\\(?1:[0-9]+\\)\\(?2:st\\|nd\\|rd\\|th\\)\\>\\)\\(?:[[:punct:]]\\|[[:space:]]\\)"
			   (line-beginning-position)))
    (undo-boundary)
    (save-excursion
      (replace-match "\\1^{\\2}" nil nil nil 3))))


(defcustom scimax-autoformat-fractions t
  "Determines if scimax autoformats fractions."
  :group 'scimax)


(defun scimax-org-autoformat-fractions ()
  "Expand fractions to take up space."
  (interactive)
  (when (and scimax-autoformat-fractions
	     (eq major-mode 'org-mode)
	     (not (org-in-src-block-p))
	     (looking-back "\\(?3:\\<\\(1/4\\|1/2\\|3/4\\)\\>\\)\\(?:[[:punct:]]\\|[[:space:]]\\)"
			   (line-beginning-position)))
    (undo-boundary)
    (save-excursion
      (replace-match (cdr (assoc (match-string 3) '(("1/4" . "¼")
						    ("1/2" . "½")
						    ("3/4" . "¾"))))
		     nil nil nil 3))))

(defun scimax-org-autoformat ()
  "Autoformat functions."
  (scimax-org-autoformat-ordinals)
  (scimax-org-autoformat-fractions))

(define-minor-mode scimax-autoformat-mode
  "Toggle `scimax-autoformat-mode'.  Converts 1st to 1^{st} as you type."
  :init-value nil
  :lighter (" om")
  (if scimax-autoformat-mode
      (add-hook 'post-self-insert-hook #'scimax-org-autoformat nil 'local)
    (remove-hook 'post-self-insert-hook #'scimax-org-autoformat 'local)))


(defcustom scimax-autoformat-months t
  "Determines if months should be auto-capitalized."
  :group 'scimax)

(when scimax-autoformat-months
  (define-global-abbrev "january" "January")
  (define-global-abbrev "february" "February")
  (define-global-abbrev "march" "March")
  (define-global-abbrev "april" "April")
  (define-global-abbrev "may" "May")
  (define-global-abbrev "june" "June")
  (define-global-abbrev "july" "July")
  (define-global-abbrev "august" "August")
  (define-global-abbrev "september" "September")
  (define-global-abbrev "october" "October")
  (define-global-abbrev "november" "November")
  (define-global-abbrev "december" "December"))


  (define-global-abbrev "monday" "Monday")
  (define-global-abbrev "tuesday" "Tuesday")
  (define-global-abbrev "wednesday" "Wednesday")
  (define-global-abbrev "thursday" "Thursday")
  (define-global-abbrev "friday" "Friday")
  (define-global-abbrev "saturday" "Saturday")
  (define-global-abbrev "sunday" "Sunday")

(define-global-abbrev "degC" "°C")
(define-global-abbrev "degF" "°F")
(define-global-abbrev "ang" "Å")


  (define-global-abbrev "arent" "are not")
  (define-global-abbrev "aren't" "are not")

  (define-global-abbrev "cant" "can not")
  (define-global-abbrev "can't" "can not")

  (define-global-abbrev "couldnt" "could not")
  (define-global-abbrev "couldn't" "could not")

  (define-global-abbrev "didnt" "did not")
  (define-global-abbrev "didn't" "did not")

  (define-global-abbrev "doesnt" "does not")
  (define-global-abbrev "doesn't" "does not")

  (define-global-abbrev "dont" "do not")
  (define-global-abbrev "don't" "do not")

  (define-global-abbrev "hadnt" "had not")
  (define-global-abbrev "hadn't" "had not")

  (define-global-abbrev "hasnt" "has not")
  (define-global-abbrev "has'nt" "has not")

  (define-global-abbrev "isnt" "is not")
  (define-global-abbrev "isn't" "is not")

  (define-global-abbrev "shouldnt" "should not")
  (define-global-abbrev "shouldn't" "should not")

  (define-global-abbrev "thats" "that is")
  (define-global-abbrev "that's" "that is")

  (define-global-abbrev "wasnt" "was not")
  (define-global-abbrev "wasn't" "was not")

  (define-global-abbrev "whos" "who is")
  (define-global-abbrev "who's" "who is")

  (define-global-abbrev "wont" "will not")
  (define-global-abbrev "won't" "will not")

  (define-global-abbrev "wouldve" "would have")
  (define-global-abbrev "would've" "would have")

  (define-global-abbrev "wouldn't" "would not")
  (define-global-abbrev "wouldnt" "would not")



  (define-global-abbrev "nad" "and")
  (define-global-abbrev "ahve" "have")
  (define-global-abbrev "fi" "if")
  (define-global-abbrev "fo" "of")
  (define-global-abbrev "nto" "not")
  (define-global-abbrev "teh" "the")
  (define-global-abbrev "hte" "the")
  (define-global-abbrev "htat" "that")
  (define-global-abbrev "htem" "them")
  (define-global-abbrev "iwth" "with")
  (define-global-abbrev "hwat" "what")
  (define-global-abbrev "waht" "what")
  (define-global-abbrev "wehn" "when")


;; Some common names with umlauts
;; (define-global-abbrev "schrodinger" "Schrödinger")
#+END_SRC
** Undo Tree                                 :MELPA_ori:
#+BEGIN_SRC emacs-lisp
(use-package undo-tree
  :init
  (global-undo-tree-mode +1)
  :bind ("C-c u" . undo-tree-visualize)
  :diminish undo-tree-mode)
#+END_SRC
** vocabuilder                               :MELPA_ori:
#+BEGIN_SRC 
(use-package voca-builder
  :ensure t
  :init
  (setq voca-builder/voca-file "/Users/Guoshiyuan/Dropbox/org_files/org_life/voca.org")
  (setq voca-builder/current-tag "General")
  (setq sentence-end-double-space nil)
  :bind (("<f1>" . voca-builder/search-popup)))
#+END_SRC
* Magit                                      :MELPA_ori:
- A great interface for git projects. It's much more pleasant to use
than the git interface on the command line. Use an easy keybinding to
access magit.
- The following code makes magit-status run alone in the frame, and then
restores the old window configuration when you quit out of magit. No more juggling windows after commiting. It's magit bliss. [[http://whattheemacsd.com/setup-magit.el-01.html][Source: Magnar Sveen]]
#+begin_src emacs-lisp
(use-package magit
  :ensure t
  :defer t
  :bind ("C-c g" . magit-status)
  :config
  (define-key magit-status-mode-map (kbd "q") 'magit-quit-session))

;; full screen magit-status
(defadvice magit-status (around magit-fullscreen activate)
  (window-configuration-to-register :magit-fullscreen)
  ad-do-it
  (delete-other-windows))

(defun magit-quit-session ()
  "Restores the previous window configuration and kills the magit buffer"
  (interactive)
  (kill-buffer)
  (jump-to-register :magit-fullscreen))
#+end_src



* Org-mode
** org directory
#+BEGIN_SRC emacs-lisp
(setq org-directory "~/Dropbox/org_files")
#+END_SRC
