config.md


<a id="org25ee2cc"></a>

## org-mode-hook

```emacs-lisp
(add-hook 'org-mode-hook 'flyspell-mode)
(add-hook 'org-mode-hook 'visual-line-mode)
(add-hook 'org-mode-hook (lambda ()
				(org-defkey org-mode-map "\C-c[" 'undefined)
				(org-defkey org-mode-map "\C-c]" 'undefined)
				(org-defkey org-mode-map "\C-c;" 'undefined)
				(org-defkey org-mode-map "\C-xf" 'undefined)
				;; (org-defkey org-mode-map "\C-n" 'org-next-link)
				;; (org-defkey org-mode-map "\C-p" 'org-previous-link)
))
(global-set-key "\C-cl" 'org-store-link)
(global-set-key "\C-ca" 'org-agenda)
(global-set-key "\C-cc" 'org-capture)
(global-set-key "\C-cb" 'org-iswitchb)
(global-set-key (kbd "C-c C-.") 'calendar)
(global-set-key (kbd "C-c v") 'org-show-todo-tree)

;; ;; handling links
;;  (add-hook 'org-load-hook
;;             (lambda ()
;;               (define-key org-mode-map "C-n" 'org-next-link)
;;               (define-key org-mode-map "C-p" 'org-previous-link)))
```


<a id="org901873a"></a>

## org structural edit


<a id="orge90e555"></a>

### org catch invisible editing

```emacs-lisp
(setq org-catch-invisible-edits t)
```


<a id="org6f0f7d6"></a>

### Org speed key command

-   Speed commands are a nice and quick way to perform certain actions

while at the beginning of a heading. It's not activated by default.

-   See the doc for speed keys by checking out [[elisp:(info%20"(org)%20speed%20keys")][the documentation for

speed keys in Org mode]].

```emacs-lisp
(setq org-use-speed-commands t)
```


<a id="org8d53c07"></a>

### org insert empty lines before inserting new heading.

```emacs-lisp
(setf org-blank-before-new-entry '((heading . nil) (plain-list-item . nil)))
```


<a id="org6d12879"></a>

### control A/E/K header behaviour

```emacs-lisp
(setq org-special-ctrl-a/e t)
(setq org-special-ctrl-k t)
```


<a id="org2efa0c0"></a>

### indentation

1.  variables related

    1.  org indent group: virtual indentation
    
        -   **Org Startup Indented:** a global setting in toggling the default state of org-indent-mode (#+startup: ). the [options](http://orgmode.org/manual/Clean-view.html) for `startup` can be:
            -   default state of org-indentation mode
            -   org-hide-leading-stars
            -   odd even
        -   **org indent boundary char:** ie. what is the character that makes heading successfully become a heading, thus get perspective face. (**\*** only takes effect when proceeded with a space. )
        -   **org indent indentation per level:** 
        
        -   **org indent mode turns on hiding stars:** mode behavior; will indentation and stars are redundant.
    
    2.  true indentation
    
        1.  org adapt indentation (on $ nil only)
        
        2.  org list indentation
        
            -   org list description max indent
            -   org list indent offset
        
        3.  src indentation: true indentation
        
            -   org edit src content indentation
            -   Org Src Preserve Indentation

2.  disable true indentation and default hide stars

    ```emacs-lisp
    (setq org-adapt-indentation nil)
    ;; (setq org-hide-leading-stars t)
    ```


<a id="orgb627011"></a>

## org-links

```emacs-lisp
;; (setq org-link-abbrev-alist
;;       '(("org_refcard" . [[http://emacs.readthedocs.io/en/latest/index.html][org_refcard]])
;;	("dotEmacs_YT" . "http://emacs.readthedocs.io/en/latest/index.html")))
```


<a id="org60475e4"></a>

## Org agenda

-   org-agenda-custom-commands: customization of your agenda variables.
-   Learned about [delq](delq) & [mapcar](mapcar) trick from [from Sacha Chua's config](https://github.com/sachac/.emacs.d/blob/83d21e473368adb1f63e582a6595450fcd0e787c/Sacha.org#org-agenda).

```emacs-lisp
  (setq org-agenda-files
	(delq nil
	      (mapcar (lambda (x) (and (file-exists-p x) x))
		      '("~/Dropbox/org_files/"))))

  ;; I don't want to see things that are done. turn that off here.
  ;; http://orgmode.org/manual/Global-TODO-list.html#Global-TODO-list
  (setq org-agenda-skip-scheduled-if-done t)
  (setq org-agenda-skip-deadline-if-done t)
  (setq org-agenda-skip-timestamp-if-done t)
  (setq org-agenda-todo-ignore-scheduled t)
  (setq org-agenda-todo-ignore-deadlines t)
  (setq org-agenda-todo-ignore-timestamp t)
  (setq org-agenda-todo-ignore-with-date t)
  (setq org-agenda-start-on-weekday nil) ;; start on current day

  (setq org-upcoming-deadline '(:foreground "blue" :weight bold))

  ;; use timestamps in date-trees. for the journal
  (setq org-datetree-add-timestamp 'active)


  ;; (add-to-list
  ;;  'org-agenda-custom-commands
  ;;  '("w" "Weekly Review"
  ;;    ( ;; deadlines
  ;;     (tags-todo "+DEADLINE<=\"<today>\""
  ;;	       ((org-agenda-overriding-header "Late Deadlines")))
  ;;     ;; scheduled  past due
  ;;     (tags-todo "+SCHEDULED<=\"<today>\""
  ;;	       ((org-agenda-overriding-header "Late Scheduled")))

  ;;     ;; now the agenda
  ;;     (agenda ""
  ;;	    ((org-agenda-overriding-header "weekly agenda")
  ;;	     (org-agenda-ndays 7)
  ;;	     (org-agenda-tags-todo-honor-ignore-options t)
  ;;	     (org-agenda-todo-ignore-scheduled nil)
  ;;	     (org-agenda-todo-ignore-deadlines nil)
  ;;	     (org-deadline-warning-days 0)))
  ;;     ;; and last a global todo list
  ;;     (todo "TODO"))))
```


<a id="org3d2063e"></a>

## org capture/refile


<a id="org32317d6"></a>

### current [org capture template](http://orgmode.org/manual/Template-expansion.html#Template-expansion).

-   debug and programming progress from debug.

```emacs-lisp
(setq org-capture-templates
      (quote (("t" "TODO_item_list" entry (file+datetree "~/Dropbox/org_files/TODO.org") "* TODO %^{Description} %^g\n  :LOGBOOK:\n  - State \"TODO\"       from              %T\n  :END:\n%?")
	      ("r" "NO_action" entry (file+datetree "~/Dropbox/org_files/TODO.org") "* %^{Description} %^g\n%?")
	      ("d" "bug_debug" entry (file+olp "~/Dropbox/org_files/tech.org" "bugs and debugs") "** TODO %^{Description} %^g\n%?")
	      ("f" "config_improvement" entry (file+olp "~/.emacs.d/config.org" "future improvement") "** TODO %^{Description} \n  :LOGBOOK:\n  - State \"TODO\"       from              %T\n  :END:\n%?")
	      ("j" "Journal_entry" entry (file+datetree "~/Dropbox/org_files/杂记.org" ) "* %?" :unnarrowed t)
	      )))
```
