config.org
*** To-her/to-him, using org-capture to communicate.
- create a =what-say.org= file.
- setup capture.
#+BEGIN_SRC
(add-to-list org-capture-templates
      (quote (("h" "to_her" entry (file+datetree "~/Dropbox/org_files/TODO.org") "* TODO %^{Description}  %^g\n%?\nAdded: %U")

#+END_SRC

** org todo
- [[help:org-use-fast-todo-selection][org-use-fast-todo-selection]]: =t= allows for single key selection.
#+BEGIN_SRC emacs-lisp
(setq org-log-done nil)
(setq org-todo-keywords
       '((sequence "TODO(t!)" "WAIT(w@/!)" "|" "DONE(d!)" "CANCELED(c@)")))
(setq org-todo-keyword-faces
      (quote (("TODO" :foreground "red" :weight bold)
	      ("DONE" :foreground "forest green" :weight bold)
	      ("WAIT" :foreground "orange" :weight bold)
	      ("CANCELED" :foreground "blue" :weight bold))))
(setq org-use-fast-todo-selection t)
#+END_SRC

*** log to [[http://emacs.stackexchange.com/questions/21291/add-created-timestamp-to-logbook][drawer]]
- [[help:org-log-into-drawer][org-log-into-drawer]]: non-nil is inserted; to where depends on:
  - t for logbook
  - property
#+BEGIN_SRC emacs-lisp
(setq org-log-into-drawer t)
(setq org-clock-into-drawer t)

;; (defvar org-created-property-name "CREATED"
;;   "The name of the org-mode property that stores the creation date of the entry")

;; (defun org-set-created-property (&optional active NAME)
;;   "Set a property on the entry giving the creation time.

;; By default the property is called CREATED. If given the `NAME'
;; argument will be used instead. If the property already exists, it
;; will not be modified."
;;   (interactive)
;;   (let* ((created (or NAME org-created-property-name))
;;          (fmt (if active "<%s>" "[%s]"))
;;          (now  (format fmt (format-time-string "%Y-%m-%d %a %H:%M"))))
;;     (unless (org-entry-get (point) created nil)
;;       (org-set-property created now))))

#+END_SRC
** Org tags
*** *tag position*: The default value is -77, which is weird for smaller width windows.
I'd rather have the tags align horizontally with the header. 45 is a
good column number to do that.
*** personal tagging system
**** two variable
- org-tag-persistent-alist
- org-tag-alist
**** the use of [[http://orgmode.org/manual/Tag-hierarchy.html][hierarchical tag]] and mutually exclusive tags
- hierarchical tags is achieved by boundary keyword with :grouptags as subcategories.
- co-exist Vs mutually exclusivity is determined by the boundary
|---------------+-------------------------------------------------|
| local #+tags: | in .emacs                                       |
|---------------+-------------------------------------------------|
| []            | co-exist:startgrouptag & :endgrouptag           |
| {}            | [[http://orgmode.org/manual/Setting-tags.html#Setting-tags][mutually exclusive tag]]: :startgroup & :endgroup |
|---------------+-------------------------------------------------|
**** TODO local: why linked tag is not fold in emacs25.

#+begin_src emacs-lisp
(setq org-tags-column 45)

(setq org-tag-persistent-alist '((:startgroup)
				 ;; ("structure" . ?w)
				 ;; (:grouptags)
				 ("motive" . ?q) ("answer" . ?a)
				 (:endgroup)
				 (:startgrouptag)
				 ("lab_book". ?l) ("admin" . ?d) ("stats" . ?s) ("presentation" . ?v) ("杂" . ?t) ("future_plan" . ?f) ("programming" . ?p)
				 (:endgrouptag)
				 ;; (:startgrouptag)
				 ;; ("programming" . ?p)
				 ;; (:grouptags)
				 ;; ("R" . ?r) ("LP" . ?l) ("emacs" . ?e) ("elisp" . ?E) ("shell" . ?b) ("regex" . ?x) ("inkscape" . ?i) ("imageJ" . ?j)
				 ;; (:endgrouptag)
))
#+end_src

** org mobile
- [[http://jonathanchu.is/posts/org-mode-and-mobileorg-installation-and-config/][jonathan chu configuration]]
- [[https://mobileorg.github.io/#using-dropbox][org-mobile-push/pull]] with a detail [[https://mobileorg.github.io/documentation/#using-dropbox][description on sync]]. 
#+BEGIN_SRC emacs-lisp
(setq org-mobile-directory "/Users/Guoshiyuan/Dropbox/Apps/MobileOrg")

#+END_SRC


* LP in org
** tab behavior
- tab indentation and program indentation with Emacs_manual 24 and 26.3 respectively.
#+BEGIN_SRC emacs-lisp
(setq-default indent-tabs-mode t)
#+END_SRC
** superscript/subscript default
#+BEGIN_SRC emacs-lisp
(setq org-export-with-sub-superscripts '{})
#+END_SRC
** DONE setup [[https://github.com/flycheck/flycheck][flycheck]] for R using [[http://www.flycheck.org/en/latest/languages.html#r][lintr]]
:LOGBOOK:
- State "DONE"       from "TODO"       [2017-06-26 Mon 18:38]
:END:
#+BEGIN_SRC emacs-lisp
(use-package flycheck
  :if (display-graphic-p)
  :bind ("C-c f" . flycheck-mode)
  :config
  (defun my-on-flycheck-status-change (status)
    (let ((fc-icon
           (cond
            ((eq status 'running) [#xF0F4])
            ((eq status 'errored) [#xF00C])
            ((eq status 'finished) [#xF00D]))))
      (diminish #'flycheck-mode (concat " " fc-icon))
      (force-mode-line-update)))

  (add-hook 'flycheck-status-changed-functions #'my-on-flycheck-status-change))
#+END_SRC
** org inline image and table
#+begin_src emacs-lisp
(setq org-startup-with-inline-images "inlineimages")
;;(setq org-image-actual-width 550)
(setq org-image-actual-width (/ (display-pixel-width) 3))
;;(setq org-image-actual-width 400)


(defun scimax-align-result-table ()
  "Align tables in the subtree."
  (save-restriction
    (save-excursion
      (unless (org-before-first-heading-p) (org-narrow-to-subtree))
      (org-element-map (org-element-parse-buffer) 'table
	(lambda (tbl)
	  (goto-char (org-element-property :begin tbl))
	  (while (not (looking-at "|")) (forward-line))
	  (org-table-align))))))
;; inline indentaiton
(add-hook 'org-babel-after-execute-hook
	  'scimax-align-result-table)
(add-hook 'org-babel-after-execute-hook
	  'org-display-inline-images)
#+end_src
** org-latex
*** latex default packages.
