config.md


<a id="org44d810b"></a>

### To-her/to-him, using org-capture to communicate.

-   create a `what-say.org` file.
-   setup capture.

```
(add-to-list org-capture-templates
      (quote (("h" "to_her" entry (file+datetree "~/Dropbox/org_files/TODO.org") "* TODO %^{Description}  %^g\n%?\nAdded: %U")
```


<a id="org0576a72"></a>

## org todo

-   [org-use-fast-todo-selection](org-use-fast-todo-selection): `t` allows for single key selection.

```emacs-lisp
(setq org-log-done nil)
(setq org-todo-keywords
       '((sequence "TODO(t!)" "WAIT(w@/!)" "|" "DONE(d!)" "CANCELED(c@)")))
(setq org-todo-keyword-faces
      (quote (("TODO" :foreground "red" :weight bold)
	      ("DONE" :foreground "forest green" :weight bold)
	      ("WAIT" :foreground "orange" :weight bold)
	      ("CANCELED" :foreground "blue" :weight bold))))
(setq org-use-fast-todo-selection t)
```


<a id="org22d76f2"></a>

### log to [drawer](http://emacs.stackexchange.com/questions/21291/add-created-timestamp-to-logbook)

-   [org-log-into-drawer](org-log-into-drawer): non-nil is inserted; to where depends on:
    -   t for logbook
    -   property

```emacs-lisp
(setq org-log-into-drawer t)
(setq org-clock-into-drawer t)

;; (defvar org-created-property-name "CREATED"
;;   "The name of the org-mode property that stores the creation date of the entry")

;; (defun org-set-created-property (&optional active NAME)
;;   "Set a property on the entry giving the creation time.

;; By default the property is called CREATED. If given the `NAME'
;; argument will be used instead. If the property already exists, it
;; will not be modified."
;;   (interactive)
;;   (let* ((created (or NAME org-created-property-name))
;;          (fmt (if active "<%s>" "[%s]"))
;;          (now  (format fmt (format-time-string "%Y-%m-%d %a %H:%M"))))
;;     (unless (org-entry-get (point) created nil)
;;       (org-set-property created now))))
```


<a id="orgc97fb35"></a>

## Org tags


<a id="org1554b6d"></a>

### **tag position**: The default value is -77, which is weird for smaller width windows.

I'd rather have the tags align horizontally with the header. 45 is a good column number to do that.


<a id="org84e39f7"></a>

### personal tagging system

1.  two variable

    -   org-tag-persistent-alist
    -   org-tag-alist

2.  the use of [hierarchical tag](http://orgmode.org/manual/Tag-hierarchy.html) and mutually exclusive tags

    -   hierarchical tags is achieved by boundary keyword with :grouptags as subcategories.
    -   co-exist Vs mutually exclusivity is determined by the boundary
    
    | local #+tags: | in .emacs                                                                                                   |
    | []            | co-exist:startgrouptag & :endgrouptag                                                                       |
    | {}            | [mutually exclusive tag](http://orgmode.org/manual/Setting-tags.html#Setting-tags): :startgroup & :endgroup |

3.  TODO local: why linked tag is not fold in emacs25.

    ```emacs-lisp
    (setq org-tags-column 45)
    
    (setq org-tag-persistent-alist '((:startgroup)
    				 ;; ("structure" . ?w)
    				 ;; (:grouptags)
    				 ("motive" . ?q) ("answer" . ?a)
    				 (:endgroup)
    				 (:startgrouptag)
    				 ("lab_book". ?l) ("admin" . ?d) ("stats" . ?s) ("presentation" . ?v) ("杂" . ?t) ("future_plan" . ?f) ("programming" . ?p)
    				 (:endgrouptag)
    				 ;; (:startgrouptag)
    				 ;; ("programming" . ?p)
    				 ;; (:grouptags)
    				 ;; ("R" . ?r) ("LP" . ?l) ("emacs" . ?e) ("elisp" . ?E) ("shell" . ?b) ("regex" . ?x) ("inkscape" . ?i) ("imageJ" . ?j)
    				 ;; (:endgrouptag)
    ))
    ```


<a id="orge24b2f5"></a>

## org mobile

-   [jonathan chu configuration](http://jonathanchu.is/posts/org-mode-and-mobileorg-installation-and-config/)
-   [org-mobile-push/pull](https://mobileorg.github.io/#using-dropbox) with a detail [description on sync](https://mobileorg.github.io/documentation/#using-dropbox).

```emacs-lisp
(setq org-mobile-directory "/Users/Guoshiyuan/Dropbox/Apps/MobileOrg")
```


<a id="org74042c7"></a>

# LP in org


<a id="org4cf586a"></a>

## tab behavior

-   tab indentation and program indentation with Emacs\_manual 24 and 26.3 respectively.

```emacs-lisp
(setq-default indent-tabs-mode t)
```


<a id="org0835845"></a>

## superscript/subscript default

```emacs-lisp
(setq org-export-with-sub-superscripts '{})
```


<a id="org23c193c"></a>

## setup [flycheck](https://github.com/flycheck/flycheck) for R using [lintr](http://www.flycheck.org/en/latest/languages.html#r)

```emacs-lisp
(use-package flycheck
  :if (display-graphic-p)
  :bind ("C-c f" . flycheck-mode)
  :config
  (defun my-on-flycheck-status-change (status)
    (let ((fc-icon
           (cond
            ((eq status 'running) [#xF0F4])
            ((eq status 'errored) [#xF00C])
            ((eq status 'finished) [#xF00D]))))
      (diminish #'flycheck-mode (concat " " fc-icon))
      (force-mode-line-update)))

  (add-hook 'flycheck-status-changed-functions #'my-on-flycheck-status-change))
```


<a id="org5320712"></a>

## org inline image and table

```emacs-lisp
(setq org-startup-with-inline-images "inlineimages")
;;(setq org-image-actual-width 550)
(setq org-image-actual-width (/ (display-pixel-width) 3))
;;(setq org-image-actual-width 400)


(defun scimax-align-result-table ()
  "Align tables in the subtree."
  (save-restriction
    (save-excursion
      (unless (org-before-first-heading-p) (org-narrow-to-subtree))
      (org-element-map (org-element-parse-buffer) 'table
	(lambda (tbl)
	  (goto-char (org-element-property :begin tbl))
	  (while (not (looking-at "|")) (forward-line))
	  (org-table-align))))))
;; inline indentaiton
(add-hook 'org-babel-after-execute-hook
	  'scimax-align-result-table)
(add-hook 'org-babel-after-execute-hook
	  'org-display-inline-images)
```
