config.el

(setq org-log-done nil)
(setq org-todo-keywords
       '((sequence "TODO(t!)" "WAIT(w@/!)" "|" "DONE(d!)" "CANCELED(c@)")))
(setq org-todo-keyword-faces
      (quote (("TODO" :foreground "red" :weight bold)
	      ("DONE" :foreground "forest green" :weight bold)
	      ("WAIT" :foreground "orange" :weight bold)
	      ("CANCELED" :foreground "blue" :weight bold))))
(setq org-use-fast-todo-selection t)

(setq org-log-into-drawer t)
(setq org-clock-into-drawer t)

;; (defvar org-created-property-name "CREATED"
;;   "The name of the org-mode property that stores the creation date of the entry")

;; (defun org-set-created-property (&optional active NAME)
;;   "Set a property on the entry giving the creation time.

;; By default the property is called CREATED. If given the `NAME'
;; argument will be used instead. If the property already exists, it
;; will not be modified."
;;   (interactive)
;;   (let* ((created (or NAME org-created-property-name))
;;          (fmt (if active "<%s>" "[%s]"))
;;          (now  (format fmt (format-time-string "%Y-%m-%d %a %H:%M"))))
;;     (unless (org-entry-get (point) created nil)
;;       (org-set-property created now))))

(setq org-tags-column 45)

(setq org-tag-persistent-alist '((:startgroup)
				 ;; ("structure" . ?w)
				 ;; (:grouptags)
				 ("motive" . ?q) ("answer" . ?a)
				 (:endgroup)
				 (:startgrouptag)
				 ("lab_book". ?l) ("admin" . ?d) ("stats" . ?s) ("presentation" . ?v) ("杂" . ?t) ("future_plan" . ?f) ("programming" . ?p)
				 (:endgrouptag)
				 ;; (:startgrouptag)
				 ;; ("programming" . ?p)
				 ;; (:grouptags)
				 ;; ("R" . ?r) ("LP" . ?l) ("emacs" . ?e) ("elisp" . ?E) ("shell" . ?b) ("regex" . ?x) ("inkscape" . ?i) ("imageJ" . ?j)
				 ;; (:endgrouptag)
))

(setq org-mobile-directory "/Users/Guoshiyuan/Dropbox/Apps/MobileOrg")

(setq-default indent-tabs-mode t)

(setq org-export-with-sub-superscripts '{})

(use-package flycheck
  :if (display-graphic-p)
  :bind ("C-c f" . flycheck-mode)
  :config
  (defun my-on-flycheck-status-change (status)
    (let ((fc-icon
           (cond
            ((eq status 'running) [#xF0F4])
            ((eq status 'errored) [#xF00C])
            ((eq status 'finished) [#xF00D]))))
      (diminish #'flycheck-mode (concat " " fc-icon))
      (force-mode-line-update)))

  (add-hook 'flycheck-status-changed-functions #'my-on-flycheck-status-change))

(setq org-startup-with-inline-images "inlineimages")
;;(setq org-image-actual-width 550)
(setq org-image-actual-width (/ (display-pixel-width) 3))
;;(setq org-image-actual-width 400)


(defun scimax-align-result-table ()
  "Align tables in the subtree."
  (save-restriction
    (save-excursion
      (unless (org-before-first-heading-p) (org-narrow-to-subtree))
      (org-element-map (org-element-parse-buffer) 'table
	(lambda (tbl)
	  (goto-char (org-element-property :begin tbl))
	  (while (not (looking-at "|")) (forward-line))
	  (org-table-align))))))
;; inline indentaiton
(add-hook 'org-babel-after-execute-hook
	  'scimax-align-result-table)
(add-hook 'org-babel-after-execute-hook
	  'org-display-inline-images)
