config.org
**** Function on org export default latex packages
- variable is [[help:org-latex-default-packages-alist][org-latex-default-packages-alist]]
- org-mode preload the following latex packages from the mac installed latex package list ([[/usr/local/texlive/2016/texmf-dist/tex/latex][latex package directory]])
 |---------------------------------------+-------------------------------------------|
 | default package alist                 | major functions                           |
 |---------------------------------------+-------------------------------------------|
 | inputenc, fontenc                     | for basic font and character selection    |
 | fixltx2e                              | important patches of latex itself         |
 | graphicx                              | for including images                      |
 | longtable                             | for multipage tables                      |
 | float, wrapfig                        | for figure placement                      |
 | rotating                              | for sideways figures and tables           |
 | ulem                                  | for underline and strike-through          |
 | amsmath                               | for subscript and superscript and         |
 |                                       | math environments                         |
 | textcomp, marvosymb, wasysym, amssymb | for various symbols used for interpreting |
 |                                       | the entities in ‘org-entities’.           |
 | hyperref                              | for cross references                      |
 |---------------------------------------+-------------------------------------------|


#+BEGIN_SRC
;; kinchin setup
(setq org-latex-default-packages-alist
      '(("AUTO" "inputenc" t)
	("" "lmodern" nil)
	("T1" "fontenc" t)
	("" "fixltx2e" nil)
	("" "graphicx" t)
	("" "longtable" nil)
	("" "float" nil)
	("" "wrapfig" nil)
	("" "rotating" nil)
	("normalem" "ulem" t)
	("" "amsmath" t)
	("" "textcomp" t)
	("" "marvosym" t)
	("" "wasysym" t)
	("" "amssymb" t)
	("" "amsmath" t)
	("version=3" "mhchem" t)
	("numbers,super,sort&compress" "natbib" nil)
	("" "natmove" nil)
	("" "url" nil)
	("" "minted" nil)
	("" "underscore" nil)
	("linktocpage,pdfstartview=FitH,colorlinks,
linkcolor=blue,anchorcolor=blue,
citecolor=blue,filecolor=blue,menucolor=blue,urlcolor=blue"
	 "hyperref" nil)
	("" "attachfile" nil)))

;; do not put in \hypersetup. Use your own if you want it e.g.
;; \hypersetup{pdfkeywords={%s},\n pdfsubject={%s},\n pdfcreator={%}}
(setq org-latex-with-hyperref nil)
#+END_SRC
*** adding [[http://mirrors.ibiblio.org/CTAN/support/latexmk/latexmk.pdf][LatexMk]] support to AUCTeX.        :MELPA_ori:
#+BEGIN_SRC emacs-lisp
(require 'auctex-latexmk)
(auctex-latexmk-setup)
#+END_SRC
*** highlight
#+BEGIN_SRC emacs-lisp
(setq org-highlight-latex-and-related '(latex script entities))
#+END_SRC
*** TODO latex preview pane
*** beamer
this was silly in the end. there was an elisp command ~org-beamer-export-to-pdf~ from ox-beamer.el dealing with beamer export that doesn't not need any default setting. The original ~C-c C-e~ runs ~org-export-dispatch~ command from ox.el. therefore just 
 #+BEGIN_SRC emacs-lisp
(setq org-latex-listings t)
(setq org-beamer-frame-level 2)


;; only applicable if using org-export-dispathch 
;; (with-eval-after-load 'ox-latex
;;   (add-to-list 'org-latex-classes
;; 	       '("beamer"
;; 	       "\\documentclass\[presentation\]\{beamer\}"
;; 	       ("\\section{%s}" . "\\section*{%s}")
;; 	       ("\\begin{frame}{%s}"
;; 		"\\end{frame}"
;; 		"\\begin{frame}{%s}"
;; 		"\\end{frame}"))))
;; (eval-after-load "ox-latex"

;;     ;; update the list of LaTeX classes and associated header (encoding, etc.)
;;     ;; and structure
;;     '(add-to-list 'org-latex-classes
;;                   `("beamer"
;;                     ,(concat "\\documentclass[presentation]{beamer}\n"
;;                              "[DEFAULT-PACKAGES]"
;;                              "[PACKAGES]"
;;                              "[EXTRA]\n")
;;                     ("\\section{%s}" . "\\section*{%s}")
;;                     ("\\subsection{%s}" . "\\subsection*{%s}")
;;                     ("\\subsubsection{%s}" . "\\subsubsection*{%s}"))))



 #+END_SRC


** Org babel languages
- loading for src language evaluation, function [[help:org-babel-do-load-languages][org-babel-do-load-lang]] load variable called [[help:org-babel-load-languages][org-babel-load-lang]].
- without the [[https://lists.gnu.org/archive/html/emacs-orgmode/2016-02/msg00415.html][bit-recompile part]], the R does not seems to work.
- =(add-to-list 'org-src-lang-modes '("<LANGUAGE>" . "<MAJOR-MODE>"))=
- for diff programming language, =Org Src Block Faces= select for language specific
#+begin_src emacs-lisp
;; lisp-interaction-mode-hook to AC
;; (add-hook 'lisp-interaction-mode-hook 'auto-complete-mode)


(byte-recompile-file
     (expand-file-name "ob-R.el"
		       (file-name-directory (locate-library "org")))
     t)

(org-babel-do-load-languages
 'org-babel-load-languages
 '((calc . t)
   (latex . t)
   (shell . t)
   (R . t)
   (emacs-lisp . t)
   (python . t)
   (ditaa . t)
))

(setq org-src-lang-modes nil)
(add-to-list 'org-src-lang-modes (quote ("shell" . shell-mode)))
(add-to-list 'org-src-lang-modes (quote ("elisp" . emacs-lisp)))
(add-to-list 'org-src-lang-modes (quote ("emacs-lisp" . emacs-lisp)))
(add-to-list 'org-src-lang-modes (quote ("R" . r)))
;;(add-to-list 'org-src-lang-modes (quote ("screen" . shell-script)))
(add-to-list 'org-src-lang-modes (quote ("python" . python)))
(add-to-list 'org-src-lang-modes (quote ("ditaa" . ditaa)))
;; (add-to-list 'org-src-lang-modes (quote ("Graphviz" . Graphviz)))
;; disable confirmation
(defun odin/org-confirm-babel-evaluate (lang body)
  (not (or (string= lang "latex") (string= lang "R") (string= lang "python") (string= lang "shell") (string= lang "emacs-lisp"))))
(setq org-confirm-babel-evaluate 'odin/org-confirm-babel-evaluate)
#+end_src

*** ess =ess-smart-S-assign= function by default has a toggling behavior: S-_(=_) insert assignment key and second time insert underscore.
- I used both assign key and underscore quite often. I will [[https://www.r-bloggers.com/a-small-customization-of-ess/][bound to assign key]] to M-- while S-_(=_) remains as underscore.
- package [[https://github.com/mattfidler/ess-smart-underscore.el][ess-smart-underscore]].



