config.el

(require 'auctex-latexmk)
(auctex-latexmk-setup)

(setq org-highlight-latex-and-related '(latex script entities))

(setq org-latex-listings t)
(setq org-beamer-frame-level 2)


;; only applicable if using org-export-dispathch 
;; (with-eval-after-load 'ox-latex
;;   (add-to-list 'org-latex-classes
;; 	       '("beamer"
;; 	       "\\documentclass\[presentation\]\{beamer\}"
;; 	       ("\\section{%s}" . "\\section*{%s}")
;; 	       ("\\begin{frame}{%s}"
;; 		"\\end{frame}"
;; 		"\\begin{frame}{%s}"
;; 		"\\end{frame}"))))
;; (eval-after-load "ox-latex"

;;     ;; update the list of LaTeX classes and associated header (encoding, etc.)
;;     ;; and structure
;;     '(add-to-list 'org-latex-classes
;;                   `("beamer"
;;                     ,(concat "\\documentclass[presentation]{beamer}\n"
;;                              "[DEFAULT-PACKAGES]"
;;                              "[PACKAGES]"
;;                              "[EXTRA]\n")
;;                     ("\\section{%s}" . "\\section*{%s}")
;;                     ("\\subsection{%s}" . "\\subsection*{%s}")
;;                     ("\\subsubsection{%s}" . "\\subsubsection*{%s}"))))

;; lisp-interaction-mode-hook to AC
;; (add-hook 'lisp-interaction-mode-hook 'auto-complete-mode)


(byte-recompile-file
     (expand-file-name "ob-R.el"
		       (file-name-directory (locate-library "org")))
     t)

(org-babel-do-load-languages
 'org-babel-load-languages
 '((calc . t)
   (latex . t)
   (shell . t)
   (R . t)
   (emacs-lisp . t)
   (python . t)
   (ditaa . t)
))

(setq org-src-lang-modes nil)
(add-to-list 'org-src-lang-modes (quote ("shell" . shell-mode)))
(add-to-list 'org-src-lang-modes (quote ("elisp" . emacs-lisp)))
(add-to-list 'org-src-lang-modes (quote ("emacs-lisp" . emacs-lisp)))
(add-to-list 'org-src-lang-modes (quote ("R" . r)))
;;(add-to-list 'org-src-lang-modes (quote ("screen" . shell-script)))
(add-to-list 'org-src-lang-modes (quote ("python" . python)))
(add-to-list 'org-src-lang-modes (quote ("ditaa" . ditaa)))
;; (add-to-list 'org-src-lang-modes (quote ("Graphviz" . Graphviz)))
;; disable confirmation
(defun odin/org-confirm-babel-evaluate (lang body)
  (not (or (string= lang "latex") (string= lang "R") (string= lang "python") (string= lang "shell") (string= lang "emacs-lisp"))))
(setq org-confirm-babel-evaluate 'odin/org-confirm-babel-evaluate)
