config.org
** Org babel/source blocks

I like to have source blocks properly syntax highlighted and with the
editing popup window staying within the same window so all the windows
don't jump around. Also, having the top and bottom trailing lines in
the block is a waste of space, so we can remove them.

I noticed that fontification doesn't work with markdown mode when the
block is indented after editing it in the org src buffer---the leading
#s for headers don't get fontified properly because they appear as Org
comments. Setting ~org-src-preserve-indentation~ makes things
consistent as it doesn't pad source blocks with leading spaces.

#+begin_src emacs-lisp
(setq org-src-fontify-natively t
      org-src-window-setup 'reorganize-frame
      org-src-strip-leading-and-trailing-blank-lines t
      org-src-preserve-indentation t
      org-src-tab-acts-natively t)
#+end_src
*** fold src block
- [[http://emacs.stackexchange.com/questions/7211/collapse-src-blocks-in-org-mode-by-default][stackexchange]]
#+BEGIN_SRC emacs-lisp
(defvar org-blocks-hidden t)

(defun f-org-toggle-blocks ()
  (interactive)
  (if org-blocks-hidden
      (org-show-block-all)
    (org-hide-block-all))
  (setq-local org-blocks-hidden (not org-blocks-hidden)))

(add-hook 'org-mode-hook 'f-org-toggle-blocks)

(define-key org-mode-map (kbd "s-1") 'f-org-toggle-blocks)
#+END_SRC


*** [[http://orgmode.org/manual/Easy-templates.html#Easy-templates][org-structure-template-alist]] on customize src expansion

** Org exporting
*** copy formatted and paste into MSword
#+BEGIN_SRC emacs-lisp
(defun formatted-copy ()
  "Export region to HTML, and copy it to the clipboard."
  (interactive)
  (save-window-excursion
    (let* ((buf (org-export-to-buffer 'html "*Formatted Copy*" nil nil t t))
	   (html (with-current-buffer buf (buffer-string))))
      (with-current-buffer buf
	(shell-command-on-region
	 (point-min)
	 (point-max)
	 "textutil -stdin -format html -convert rtf -stdout | pbcopy"))
      (kill-buffer buf))))

(global-set-key (kbd "s-w") 'formatted-copy)
#+END_SRC
*** org table exporting
- the [[help:org-table-export][org-table-export]] introduced on[[http://emacs.stackexchange.com/questions/16640/can-i-export-a-specific-table-in-an-org-file-to-csv-from-the-command-line][ stackexchange]]
- bash massive export
=$ emacs --batch foo.org -l setup.el --eval '(my-tbl-export "first-table")'=
#+BEGIN_SRC emacs-lisp
(defun f-tbl-export (name)
  "Search for table named `NAME` and export."
  (interactive "s")
  (show-all)
  (let ((case-fold-search t))
    (if (search-forward-regexp (concat "#\\+NAME: +" name) nil t)
    (progn
      (next-line)
      (org-table-export (format "%s.csv" name) "orgtbl-to-csv")))))
#+END_SRC
** org-ref                                   :MELPA_ori:
- the [[https://github.com/jkitchin/org-ref][github repository]] from [[http://kitchingroup.cheme.cmu.edu][kichen group]].
- [[help:org-ref-cancel-link-messages][org-ref-cancel-link-meessage]]: showing (key, value, begin, end, post-blank, post-affiliation, parent) at every cursor position.
#+BEGIN_SRC emacs-lisp
(setq org-ref-bibliography-notes "~/Dropbox/bibliography/notes.org"
      org-ref-default-bibliography '("~/Dropbox/bibliography/references.bib")
      org-ref-pdf-directory "~/Dropbox/bibliography/bibtex-pdfs/")
(setq bibtex-completion-bibliography "~/Dropbox/bibliography/references.bib"
      bibtex-completion-library-path "~/Dropbox/bibliography/bibtex-pdfs"
      bibtex-completion-notes-path "~/Dropbox/bibliography/helm-bibtex-notes")
(setq bibtex-completion-pdf-open-function 'org-open-file)
(require 'org-ref)
(require 'org-ref-pdf)
(require 'org-ref-url-utils)
(require 'doi-utils)
(require 'org-ref-wos)

(org-ref-cancel-link-messages)

#+END_SRC
** Yasnippet and template                    :MELPA_ori:
*** TODO yasnippet loading
- yas does not load automatically upon entering
#+BEGIN_SRC emacs-lisp
(use-package yasnippet
  :ensure t
  :init (yas-global-mode 1)
  :config
  ;; (progn
  ;;   (yas-reload-all))
  )
#+END_SRC



*** org-template: [[http://stackoverflow.com/questions/19145433/shortcut-for-inserting-environments-in-org-mode][org-structure-template-alist]]
#+BEGIN_SRC emacs-lisp
;; add <el for emacs-lisp expansion
(add-to-list 'org-structure-template-alist
	     '("el" "#+BEGIN_SRC emacs-lisp\n?\n#+END_SRC"
	       "<src lang=\"emacs-lisp\">\n?\n</src>"))

;; add <sh for shell
(add-to-list 'org-structure-template-alist
	     '("sh" "#+BEGIN_SRC sh\n?\n#+END_SRC"
	       "<src lang=\"shell\">\n?\n</src>"))

(add-to-list 'org-structure-template-alist
	     '("lh" "#+latex_header: " ""))

(add-to-list 'org-structure-template-alist
	     '("lc" "#+latex_class: " ""))

(add-to-list 'org-structure-template-alist
	     '("lco" "#+latex_class_options: " ""))

(add-to-list 'org-structure-template-alist
	     '("ao" "#+attr_org: " ""))

(add-to-list 'org-structure-template-alist
	     '("al" "#+attr_latex: " ""))

(add-to-list 'org-structure-template-alist
	     '("ca" "#+caption: " ""))

(add-to-list 'org-structure-template-alist
	     '("tn" "#+tblname: " ""))

(add-to-list 'org-structure-template-alist
	     '("n" "#+name: " ""))
(add-to-list 'org-structure-template-alist
	     '("r" "#+BEGIN_SRC R :results output \n?\n#+END_SRC"))

(add-to-list 'org-structure-template-alist
	     '("R" "#+BEGIN_SRC R :results output graphics :file ./test.png :exports results \n?\n#+END_SRC"))

#+END_SRC


** ESS
*** reference list
  - [[https://github.com/imbs-hl/emacs.d/blob/master/config/init-46-coding-R.el][IMBS@Lübeck, Germany]]
  - [[https://www.emacswiki.org/emacs/EmacsSpeaksStatistics][ess wiki]]
*** babel:R configuration
**** ess and ess-site and its general configuration, including face and indentation
**** R-related key binding:
1. =ess-smart-S-assign=
2. restart (s-S-F10)
3. =s-RET= evaluation (mimicing Rstudio behavior)
4. pipe(%>% as s-M)
**** initialization windows. (a few defun by )
**** autocompletion.
**** indentation by [[https://github.com/emacs-ess/ESS/issues/96][variable]] [[help:ess-own-style-list][ess-own-style-list]].
