config.org
**** ess-smart-underscore

#+BEGIN_SRC emacs-lisp
(unless (getenv "LANG") (setenv "LANG" "en_US.UTF-8"))

(use-package ess
  :ensure t
  :defer t
  :commands R
  :mode ("\\.[rR]\\'" . R-mode)
  :config
  ;; (setq ess-history-file "~/.Rhisotry")
  ;; (setq ess-R-font-lock-keywords
  ;; 	'((ess-R-fl-keyword:modifiers . t)
  ;; 	  (ess-R-fl-keyword:fun-defs . t)
  ;; 	  (ess-R-fl-keyword:keywords . t)
  ;; 	  (ess-R-fl-keyword:assign-ops . t)
  ;; 	  (ess-R-fl-keyword:constants . t)
  ;; 	  (ess-fl-keyword:fun-calls)
  ;; 	  (ess-fl-keyword:numbers)
  ;; 	  (ess-fl-keyword:operators)
  ;; 	  (ess-fl-keyword:delimiters)
  ;; 	  (ess-fl-keyword:=)
  ;; 	  (ess-R-fl-keyword:F&T . t)
  ;; 	  (ess-R-fl-keyword:%op% . t)))
  ;; (setq inferior-R-font-lock-keywords
  ;; 	'((ess-S-fl-keyword:prompt . t)
  ;; 	  (ess-R-fl-keyword:messages . t)
  ;; 	  (ess-R-fl-keyword:modifiers . t)
  ;; 	  (ess-R-fl-keyword:fun-defs . t)
  ;; 	  (ess-R-fl-keyword:keywords . t)
  ;; 	  (ess-R-fl-keyword:assign-ops . t)
  ;; 	  (ess-R-fl-keyword:constants . t)
  ;; 	  (ess-fl-keyword:matrix-labels . t)
  ;; 	  (ess-fl-keyword:fun-calls)
  ;; 	  (ess-fl-keyword:numbers)
  ;; 	  (ess-fl-keyword:operators)
  ;; 	  (ess-fl-keyword:delimiters)
  ;; 	  (ess-fl-keyword:=)
  ;; 	  (ess-R-fl-keyword:F&T . t)))


  :init
  (require 'ess-site)
  (setq ess-ask-for-ess-directory nil)
  (setq ess-local-process-name "R")
  (setq ansi-color-for-comint-mode 'filter)
  (setq comint-scroll-to-bottom-on-input t)
  (setq comint-scroll-to-bottom-on-output t)
  (setq comint-move-point-for-output t)
  (setq ess-eval-visibly-p 'nowait)
  (setq ess-S-assign-key (kbd "M--"))
  (ess-toggle-S-assign-key t) ; enable above key definition
  ;; leave my underscore key alone!
  (ess-toggle-underscore nil)
  
  (defun R_pipe ()
    "%>% operator in R"
    (interactive)
    (just-one-space 1)
    (insert "%>%")
    (reindent-then-newline-and-indent))

  (defun my-ess-start-R ()
    (interactive)
    (if (not (member "*R-main*" (mapcar (function buffer-name) (buffer-list))))
	(progn
	  (delete-other-windows)
	  (setq w1 (selected-window))
	  (setq w1name (buffer-name))
	  (setq w2 (split-window w1 nil t))
	  (R)
	  (set-window-buffer w2 "*R*")
	  (rename-buffer "*R-main*")
	  (set-window-buffer w1 w1name))))
  (defun my-ess-eval ()
    (interactive)
    (my-ess-start-R)
    (if (and transient-mark-mode mark-active)
	(call-interactively 'ess-eval-region)
      (call-interactively 'ess-eval-line-and-step)))
  (defun my-ess-init ()
    "Init my ess mode."
    (setq ess-help-own-frame 'one)
    (setq ess-tab-complete-in-script t)
    (setq ess-first-tab-never-complete
          'symbol-or-paren-or-punct))



  (define-key ess-mode-map (kbd "C-%") 'R_pipe)
  (define-key inferior-ess-mode-map (kbd "C-%") 'R-pipe)
  (define-key comint-mode-map [C-up] 'comint-previous-matching-input-from-input)
  (define-key comint-mode-map [C-down] 'comint-next-matching-input-from-input)
  (add-hook 'ess-mode-hook
  	  '(lambda()
  	     (local-set-key [(shift return)] 'my-ess-eval)))
  (add-hook 'Rnw-mode-hook
  	  '(lambda()
  	     (local-set-key [(shift return)] 'my-ess-eval)))
  (add-hook 'ess-mode-hook
  	  (lambda ()
  	    (flyspell-prog-mode)
  	    (run-hooks 'prog-mode-hook)
  	    ))
  (add-hook 'ess-R-post-run-hook (lambda () (smartparens-mode 1)))

  (add-hook 'inferior-ess-mode-hook
  	  '(lambda()
  	     (local-set-key [C-up] 'comint-previous-input)
  	     (local-set-key [C-down] 'comint-next-input)))

  (add-hook 'ess-mode-hook #'my-ess-init)
  (add-hook 'inferior-ess-mode-hook #'turn-on-smartparens-mode)
    )



;; (use-package pretty-mode
;;   :ensure t
;;   :init
;;   (add-hook 'ess-mode-hook 'turn-on-pretty-mode))




;; (use-package polymode		; ESS with polymode
;;   :ensure t
;;   :defer t
;;   :init
;;   (require 'poly-R)		; Load necessary modes
;;   (require 'poly-markdown)
;;   (require 'poly-noweb)
;;   :config
;;   (add-to-list 'auto-mode-alist '("\\.md" . poly-markdown-mode))
;;   (add-to-list 'auto-mode-alist '("\\.Snw" . poly-noweb+r-mode))
;;   (add-to-list 'auto-mode-alist '("\\.Rnw" . poly-noweb+r-mode))
;;   (add-to-list 'auto-mode-alist '("\\.Rmd" . poly-markdown+r-mode))
;;   )


;; help and auto-completion
(use-package ess-R-object-popup
  :ensure t
  :bind (:map ess-mode-map
	      ("\C-c\C-g" . ess-R-object-popup)))

;; company completion?? i thought ess has its own completion

(add-hook 'R-mode-hook
        (defun my-R-mode-hook ()
          (company-mode)
          (local-set-key (kbd "TAB") 'company-complete)))

(setq company-selection-wrap-around t
      company-tooltip-align-annotations t
      company-idle-delay 0.36
      company-minimum-prefix-length 2
      company-tooltip-limit 10)

;; ess-initiation



;; Tang Yi



#+END_SRC



*** kill R process
- by default, it binds to C-c C-\ key
