config.org
** why not we use org? here is org2jekyll. 
#+BEGIN_SRC emacs-lisp
(use-package org2jekyll
  :defer 3
  :config
  (custom-set-variables '(org2jekyll-blog-author       "Shiyuan Guo")
                        '(org2jekyll-source-directory  (expand-file-name "/Users/Guoshiyuan/Dropbox/org_files/future/GuoSY_blog/org_post"))
                        '(org2jekyll-jekyll-directory  (expand-file-name "/Users/Guoshiyuan/Dropbox/org_files/future/GuoSY_blog/shiyuan.github.io"))
                        '(org2jekyll-jekyll-drafts-dir "")
                        '(org2jekyll-jekyll-posts-dir  "_posts/")
                        '(org-publish-project-alist
                          `(("default"
                             :base-directory ,(org2jekyll-input-directory)
                             :base-extension "org"
                             ;; :publishing-directory "/ssh:user@host:~/html/notebook/"
                             :publishing-directory ,(org2jekyll-output-directory)
                             :publishing-function org-gfm-publish-to-gfm
                             :headline-levels 4
                             :section-numbers nil
                             :with-toc nil
                             :html-head "<link rel=\"stylesheet\" href=\"./css/style.css\" type=\"text/css\"/>"
                             :html-preamble t
                             :recursive t
                             :make-index t
                             :html-extension "md"
                             :body-only t)

                            ("post"
                             :base-directory ,(org2jekyll-input-directory)
                             :base-extension "org"
                             :publishing-directory ,(org2jekyll-output-directory org2jekyll-jekyll-posts-dir)
                             :publishing-function org-gfm-publish-to-gfm
                             :headline-levels 4
                             :section-numbers nil
                             :with-toc nil
                             :html-head "<link rel=\"stylesheet\" href=\"./css/style.css\" type=\"text/css\"/>"
                             :html-preamble t
                             :recursive t
                             :make-index t
                             :html-extension "md"
                             :body-only t)

                            ("images"
                             :base-directory ,(org2jekyll-input-directory "img")
                             :base-extension "jpg\\|gif\\|png"
                             :publishing-directory ,(org2jekyll-output-directory "img")
                             :publishing-function org-publish-attachment
                             :recursive t)
			    
                            ("files"
                             :base-directory ,(org2jekyll-input-directory "artefects")
                             :base-extension "pdf\\|csv\\|tex\\|xlsx\\|xls"
                             :publishing-directory ,(org2jekyll-output-directory "artefects")
                             :publishing-function org-publish-attachment
                             :recursive t)			    

                            ("js"
                             :base-directory ,(org2jekyll-input-directory "js")
                             :base-extension "js"
                             :publishing-directory ,(org2jekyll-output-directory "js")
                             :publishing-function org-publish-attachment
                             :recursive t)

                            ("css"
                             :base-directory ,(org2jekyll-input-directory "css")
                             :base-extension "css\\|el"
                             :publishing-directory ,(org2jekyll-output-directory "css")
                             :publishing-function org-publish-attachment
                             :recursive t)

                            ("web" :components ("images" "js" "css"))))))

(provide 'blog-pack)
#+END_SRC

#+BEGIN_SRC 
;; from worg about teaching org export to jekyll directory [[http://orgmode.org/worg/org-tutorials/org-jekyll.html]]
(setq org-publish-project-alist
      '(

  ("org-ianbarton"
          ;; Path to your org files.
          :base-directory "~/devel/ianbarton/org/"
          :base-extension "org"

          ;; Path to your Jekyll project.
          :publishing-directory "~/devel/ianbarton/jekyll/"
          :recursive t
          :publishing-function org-publish-org-to-html
          :headline-levels 4 
          :html-extension "html"
          :body-only t ;; Only export section between <body> </body>
    )


    ("org-static-ian"
          :base-directory "~/devel/ianbarton/org/"
          :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf\\|php"
          :publishing-directory "~/devel/ianbarton/"
          :recursive t
          :publishing-function org-publish-attachment)

    ("ian" :components ("org-ianbarton" "org-static-ian"))

))
#+END_SRC
* future improvement
** TODO customise date and develop a better capture template for todo and lab log :programming:
***** time customisation: add a customise label similar as 200117
- [[http://stackoverflow.com/questions/19532371/how-to-insert-schedule-with-date-and-time-in-emacs-org-mode/19538085#19538085][How to insert schedule with date and time in Emacs org-mode]]
- [[http://stackoverflow.com/questions/23218316/org-mode-org-time-stamp-custom-formats-shows-midnight-time][org-mode: org-time-stamp-custom-formats shows midnight time]](show  [[http://orgmode.org/manual/Custom-time-format.html][org-time-stamp-custom-formats]] legit format)
- [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Time-Parsing.html][time customisation man page]]

