config.md


<a id="org2450a57"></a>

## why not we use org? here is org2jekyll.

```emacs-lisp
(use-package org2jekyll
  :defer 3
  :config
  (custom-set-variables '(org2jekyll-blog-author       "Shiyuan Guo")
                        '(org2jekyll-source-directory  (expand-file-name "/Users/Guoshiyuan/Dropbox/org_files/testing_ground/denten_org"))
                        '(org2jekyll-jekyll-directory  (expand-file-name "/Users/Guoshiyuan/Dropbox/org_files/testing_ground/denten"))
                        '(org2jekyll-jekyll-drafts-dir "")
                        '(org2jekyll-jekyll-posts-dir  "_posts/")
                        '(org-publish-project-alist
                          `(("default"
                             :base-directory ,(org2jekyll-input-directory)
                             :base-extension "org"
                             ;; :publishing-directory "/ssh:user@host:~/html/notebook/"
                             :publishing-directory ,(org2jekyll-output-directory)
                             :publishing-function org-gfm-export-to-markdown
                             :headline-levels 4
                             :section-numbers nil
                             :with-toc nil
                             :html-head "<link rel=\"stylesheet\" href=\"./css/style.css\" type=\"text/css\"/>"
                             :html-preamble t
                             :recursive t
                             :make-index t
                             :html-extension "md"
                             :body-only t)

                            ("post"
                             :base-directory ,(org2jekyll-input-directory)
                             :base-extension "org"
                             :publishing-directory ,(org2jekyll-output-directory org2jekyll-jekyll-posts-dir)
                             :publishing-function org-gfm-export-to-markdown
                             :headline-levels 4
                             :section-numbers nil
                             :with-toc nil
                             :html-head "<link rel=\"stylesheet\" href=\"./css/style.css\" type=\"text/css\"/>"
                             :html-preamble t
                             :recursive t
                             :make-index t
                             :html-extension "md"
                             :body-only t)

                            ("images"
                             :base-directory ,(org2jekyll-input-directory "img")
                             :base-extension "jpg\\|gif\\|png"
                             :publishing-directory ,(org2jekyll-output-directory "img")
                             :publishing-function org-publish-attachment
                             :recursive t)

                            ("js"
                             :base-directory ,(org2jekyll-input-directory "js")
                             :base-extension "js"
                             :publishing-directory ,(org2jekyll-output-directory "js")
                             :publishing-function org-publish-attachment
                             :recursive t)

                            ("css"
                             :base-directory ,(org2jekyll-input-directory "css")
                             :base-extension "css\\|el"
                             :publishing-directory ,(org2jekyll-output-directory "css")
                             :publishing-function org-publish-attachment
                             :recursive t)

                            ("web" :components ("images" "js" "css"))))))

(provide 'blog-pack)
```

```
;; from worg about teaching org export to jekyll directory [[http://orgmode.org/worg/org-tutorials/org-jekyll.html]]
(setq org-publish-project-alist
      '(

  ("org-ianbarton"
          ;; Path to your org files.
          :base-directory "~/devel/ianbarton/org/"
          :base-extension "org"

          ;; Path to your Jekyll project.
          :publishing-directory "~/devel/ianbarton/jekyll/"
          :recursive t
          :publishing-function org-publish-org-to-html
          :headline-levels 4 
          :html-extension "html"
          :body-only t ;; Only export section between <body> </body>
    )


    ("org-static-ian"
          :base-directory "~/devel/ianbarton/org/"
          :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf\\|php"
          :publishing-directory "~/devel/ianbarton/"
          :recursive t
          :publishing-function org-publish-attachment)

    ("ian" :components ("org-ianbarton" "org-static-ian"))

))
```


<a id="orgba37b6e"></a>

# future improvement


<a id="org923ed5f"></a>

## customise date and develop a better capture template for todo and lab log     :programming:

1.  time customisation: add a customise label similar as 200117

    -   [How to insert schedule with date and time in Emacs org-mode](http://stackoverflow.com/questions/19532371/how-to-insert-schedule-with-date-and-time-in-emacs-org-mode/19538085#19538085)
    -   [org-mode: org-time-stamp-custom-formats shows midnight time](http://stackoverflow.com/questions/23218316/org-mode-org-time-stamp-custom-formats-shows-midnight-time)(show [org-time-stamp-custom-formats](http://orgmode.org/manual/Custom-time-format.html) legit format)
    -   [time customisation man page](https://www.gnu.org/software/emacs/manual/html_node/elisp/Time-Parsing.html)
