config.el

(use-package org2jekyll
  :defer 3
  :config
  (custom-set-variables '(org2jekyll-blog-author       "Shiyuan Guo")
                        '(org2jekyll-source-directory  (expand-file-name "/Users/Guoshiyuan/Dropbox/org_files/future/GuoSY_blog/org_post"))
                        '(org2jekyll-jekyll-directory  (expand-file-name "/Users/Guoshiyuan/Dropbox/org_files/future/GuoSY_blog/shiyuan.github.io"))
                        '(org2jekyll-jekyll-drafts-dir "")
                        '(org2jekyll-jekyll-posts-dir  "_posts/")
                        '(org-publish-project-alist
                          `(("default"
                             :base-directory ,(org2jekyll-input-directory)
                             :base-extension "org"
                             ;; :publishing-directory "/ssh:user@host:~/html/notebook/"
                             :publishing-directory ,(org2jekyll-output-directory)
                             :publishing-function org-gfm-publish-to-gfm
                             :headline-levels 4
                             :section-numbers nil
                             :with-toc nil
                             :html-head "<link rel=\"stylesheet\" href=\"./css/style.css\" type=\"text/css\"/>"
                             :html-preamble t
                             :recursive t
                             :make-index t
                             :html-extension "md"
                             :body-only t)

                            ("post"
                             :base-directory ,(org2jekyll-input-directory)
                             :base-extension "org"
                             :publishing-directory ,(org2jekyll-output-directory org2jekyll-jekyll-posts-dir)
                             :publishing-function org-gfm-publish-to-gfm
                             :headline-levels 4
                             :section-numbers nil
                             :with-toc nil
                             :html-head "<link rel=\"stylesheet\" href=\"./css/style.css\" type=\"text/css\"/>"
                             :html-preamble t
                             :recursive t
                             :make-index t
                             :html-extension "md"
                             :body-only t)

                            ("images"
                             :base-directory ,(org2jekyll-input-directory "img")
                             :base-extension "jpg\\|gif\\|png"
                             :publishing-directory ,(org2jekyll-output-directory "img")
                             :publishing-function org-publish-attachment
                             :recursive t)
			    
                            ("files"
                             :base-directory ,(org2jekyll-input-directory "artefects")
                             :base-extension "pdf\\|csv\\|tex\\|xlsx\\|xls"
                             :publishing-directory ,(org2jekyll-output-directory "artefects")
                             :publishing-function org-publish-attachment
                             :recursive t)			    

                            ("js"
                             :base-directory ,(org2jekyll-input-directory "js")
                             :base-extension "js"
                             :publishing-directory ,(org2jekyll-output-directory "js")
                             :publishing-function org-publish-attachment
                             :recursive t)

                            ("css"
                             :base-directory ,(org2jekyll-input-directory "css")
                             :base-extension "css\\|el"
                             :publishing-directory ,(org2jekyll-output-directory "css")
                             :publishing-function org-publish-attachment
                             :recursive t)

                            ("web" :components ("images" "js" "css"))))))

(provide 'blog-pack)
