config.org
***** date tree customse to make it a flat structure instead of heavily nest as shown in this document
- [[http://sachachua.com/blog/2015/02/org-mode-reusing-date-file-datetree-prompt/][date tree from sasha]]
- [[http://stackoverflow.com/questions/26648731/refile-existing-entry-to-different-location-in-org-mode-date-tree/26683663][refile date tree (with lisp code) ]]
- [[http://members.optusnet.com.au/~charles57/GTD/datetree.html][a typical customisation page]]
- [[http://doc.norang.ca/org-mode.html][norang]]
Added: [2017-01-20 Fri 09:44]

** TODO to understand emacs default path     :programming:
- [[help:load-path][load-path]]
- [[help:default-directory][default-directory]]
Added: [2017-02-14 Tue 10:27]

** DONE open links custumisation             :programming:
- open an link according to its extension
- open an directory in Finder@mac or in dired, optionable.
Added: [2017-02-14 Tue 11:00]
** [[http://ergoemacs.org/emacs/emacs_upcase_sentence.html][capitalization after full stop]].
** TODO <2017-02-23 Thu> strange thing happens after initiation
- org src block has change from org-block-background to org-block
- [[https://github.com/syl20bnr/spacemacs/issues/4618][issue name]].
** TODO [[https://github.com/mhayashi1120/Emacs-langtool][langtool]] for grammar check

** nanowrimo for word count and general documentation monitor.

** thesaurus package
- synonymous
- synonyms
- synosaurus
** TODO GRE voca builder
   :LOGBOOK:
   - State "TODO"       from              [2017-03-10 Fri 11:25]
   :END:

** smex: enhancement for of M-x, similar as ido.

** winner-mode for undo??

** autopair global mode
** TODO [[http://blog.binchen.org/posts/turn-off-linum-mode-when-file-is-too-big.html][Turn off linum-mode when file is too big]].



#+BEGIN_SRC

#+END_SRC

** TODO polymode affecting face for source code.
- poly mode change the nature of org source code so that
|-------------+----------------------+----------------------------------------------------------|
|             | before               | after                                                    |
|-------------+----------------------+----------------------------------------------------------|
| #+begin_src | org-block-begin-line |                                                          |
| src         | org-block            |                                                          |
| #+end_src   | org-block-end-line   | org-meta-line, which inherit from font-lock-comment-face |
|-------------+----------------------+----------------------------------------------------------|

** TODO optimizing expand region behavior.
- highlight a region and add [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Org-Authoring.html#Org-Authoring][org markup]]

** TODO yas-snippet need to restart before functioning. why??
** DONE is it possible to have src have similar behavior as neighboring header (in folding, maybe)
** TODO [[help:org-support-shift-select][org-support-shift-selection]]
** TODO image justification in LaTeX @ kinchin
#+BEGIN_SRC
(defun org-latex-fragment-tooltip (beg end image imagetype)
  "Add the fragment tooltip to the overlay and set click function to toggle it."
  (overlay-put (ov-at) 'help-echo
	       (concat (buffer-substring beg end)
		       "\nmouse-1 to toggle."))
  (overlay-put (ov-at) 'local-map (let ((map (make-sparse-keymap)))
				    (define-key map [mouse-1]
				      `(lambda ()
					 (interactive)
					 (org-remove-latex-fragment-image-overlays ,beg ,end)))
				    map)))

(advice-add 'org--format-latex-make-overlay :after 'org-latex-fragment-tooltip)

(defun org-latex-fragment-justify (justification)
  "Justify the latex fragment at point with JUSTIFICATION.
JUSTIFICATION is a symbol for 'left, 'center or 'right."
  (interactive
   (list (intern-soft
	  (completing-read "Justification (left): " '(left center right)
			   nil t nil nil 'left))))

  (let* ((ov (ov-at))
	 (beg (ov-beg ov))
	 (end (ov-end ov))
	 (shift (- beg (line-beginning-position)))
	 (img (overlay-get ov 'display))
	 (img (and (and img (consp img) (eq (car img) 'image)
			(image-type-available-p (plist-get (cdr img) :type)))
		   img))
	 space-left offset)
    (when (and img (= beg (line-beginning-position)))
      (setq space-left (- (window-max-chars-per-line) (car (image-display-size img)))
	    offset (floor (cond
			   ((eq justification 'center)
			    (- (/ space-left 2) shift))
			   ((eq justification 'right)
			    (- space-left shift))
			   (t
			    0))))
      (when (>= offset 0)
	(overlay-put ov 'before-string (make-string offset ?\ ))))))

(defun org-latex-fragment-justify-advice (beg end image imagetype)
  "After advice function to justify fragments."
  (org-latex-fragment-justify (or (plist-get org-format-latex-options :justify) 'left)))

(advice-add 'org--format-latex-make-overlay :after 'org-latex-fragment-justify-advice)

;; ** numbering latex equations
(defun org-renumber-environment (orig-func &rest args)
  "A function to inject numbers in LaTeX fragment previews."
  (let ((results '())
	(counter -1)
	(numberp))

    (setq results (loop for (begin .  env) in
			(org-element-map (org-element-parse-buffer) 'latex-environment
			  (lambda (env)
			    (cons
			     (org-element-property :begin env)
			     (org-element-property :value env))))
			collect
			(cond
			 ((and (string-match "\\\\begin{equation}" env)
			       (not (string-match "\\\\tag{" env)))
			  (incf counter)
			  (cons begin counter))
			 ((string-match "\\\\begin{align}" env)
			  (prog2
			      (incf counter)
			      (cons begin counter)
			    (with-temp-buffer
			      (insert env)
			      (goto-char (point-min))
			      ;; \\ is used for a new line. Each one leads to a number
			      (incf counter (count-matches "\\\\$"))
			      ;; unless there are nonumbers.
			      (goto-char (point-min))
			      (decf counter (count-matches "\\nonumber")))))
			 (t
			  (cons begin nil)))))

    (when (setq numberp (cdr (assoc (point) results)))
      (setf (car args)
	    (concat
	     (format "\\setcounter{equation}{%s}\n" numberp)
	     (car args)))))

  (apply orig-func args))

(advice-add 'org-create-formula-image :around #'org-renumber-environment)

#+END_SRC




** TODO improve emacs visualing nonstd symbols. :programming:
     :LOGBOOK:
     - State "TODO"       from              <2017-03-07 Tue 16:01>
     :END:
- degree sign
- volume units.
** DONE capture has a strange indentation    :programming:
     :LOGBOOK:
     - State "TODO"       from              <2017-03-11 Sat 20:12>
     :END:
- C-h a on "indentation"
** TODO to prevent org-babel large output causing system hang.
** CANCELED chinese-fonts-setup              :MELPA_ori:
#+BEGIN_SRC
(require 'chinese-fonts-setup)
(chinese-fonts-setup-enable)
(set-face-attribute
 'default nil
 :font (font-spec :name "-*-Monaco-normal-normal-normal-*-*-*-*-*-m-0-iso10646-1"
		  :weight 'normal
		  :slant 'normal
		  :size 12.5))
(dolist (charset '(kana han symbol cjk-misc bopomofo))
  (set-fontset-font
   (frame-parameter nil 'font)
   charset
   (font-spec :name "-*-STKaiti-normal-normal-normal-*-*-*-*-*-p-0-iso10646-1"
	      :weight 'normal
	      :slant 'normal
	      :size 15.0)))
#+END_SRC
** TODO org bullets
- org-bullet mode
