config.md

2.  date tree customse to make it a flat structure instead of heavily nest as shown in this document

    -   [date tree from sasha](http://sachachua.com/blog/2015/02/org-mode-reusing-date-file-datetree-prompt/)
    -   [refile date tree (with lisp code) ](http://stackoverflow.com/questions/26648731/refile-existing-entry-to-different-location-in-org-mode-date-tree/26683663)
    -   [a typical customisation page](http://members.optusnet.com.au/~charles57/GTD/datetree.html)
    -   [norang](http://doc.norang.ca/org-mode.html)
    
    Added: <span class="timestamp-wrapper"><span class="timestamp">[2017-01-20 Fri 09:44]</span></span>


<a id="org252d47f"></a>

## to understand emacs default path     :programming:

-   [load-path](load-path)
-   [default-directory](default-directory)

Added: <span class="timestamp-wrapper"><span class="timestamp">[2017-02-14 Tue 10:27]</span></span>


<a id="orge9a10ec"></a>

## open links custumisation     :programming:

-   open an link according to its extension
-   open an directory in Finder@mac or in dired, optionable.

Added: <span class="timestamp-wrapper"><span class="timestamp">[2017-02-14 Tue 11:00]</span></span>


<a id="org5392647"></a>

## [capitalization after full stop](http://ergoemacs.org/emacs/emacs_upcase_sentence.html).


<a id="org809177b"></a>

## <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-02-23 Thu&gt; </span></span> strange thing happens after initiation

-   org src block has change from org-block-background to org-block
-   [issue name](https://github.com/syl20bnr/spacemacs/issues/4618).


<a id="org25743ad"></a>

## [langtool](https://github.com/mhayashi1120/Emacs-langtool) for grammar check


<a id="org2d312a1"></a>

## nanowrimo for word count and general documentation monitor.


<a id="orgd2643fc"></a>

## thesaurus package

-   synonymous
-   synonyms
-   synosaurus


<a id="orgb37f3b0"></a>

## GRE voca builder


<a id="org8f7c454"></a>

## smex: enhancement for of M-x, similar as ido.


<a id="orgf28d99e"></a>

## winner-mode for undo??


<a id="org5cc299b"></a>

## autopair global mode


<a id="orga6797da"></a>

## [Turn off linum-mode when file is too big](http://blog.binchen.org/posts/turn-off-linum-mode-when-file-is-too-big.html).

```
```


<a id="org4f1631f"></a>

## polymode affecting face for source code.

-   poly mode change the nature of org source code so that

|              | before               | after                                                    |
| #+begin\_src | org-block-begin-line |                                                          |
| src          | org-block            |                                                          |
| #+end\_src   | org-block-end-line   | org-meta-line, which inherit from font-lock-comment-face |


<a id="orgaba1f7d"></a>

## optimizing expand region behavior.

-   highlight a region and add [org markup](https://www.gnu.org/software/emacs/manual/html_node/emacs/Org-Authoring.html#Org-Authoring)


<a id="org52af001"></a>

## yas-snippet need to restart before functioning. why??


<a id="org6c7c1d3"></a>

## is it possible to have src have similar behavior as neighboring header (in folding, maybe)


<a id="orgdfcc787"></a>

## [org-support-shift-selection](org-support-shift-select)


<a id="org227aa4c"></a>

## image justification in LaTeX @ kinchin

```
(defun org-latex-fragment-tooltip (beg end image imagetype)
  "Add the fragment tooltip to the overlay and set click function to toggle it."
  (overlay-put (ov-at) 'help-echo
	       (concat (buffer-substring beg end)
		       "\nmouse-1 to toggle."))
  (overlay-put (ov-at) 'local-map (let ((map (make-sparse-keymap)))
				    (define-key map [mouse-1]
				      `(lambda ()
					 (interactive)
					 (org-remove-latex-fragment-image-overlays ,beg ,end)))
				    map)))

(advice-add 'org--format-latex-make-overlay :after 'org-latex-fragment-tooltip)

(defun org-latex-fragment-justify (justification)
  "Justify the latex fragment at point with JUSTIFICATION.
JUSTIFICATION is a symbol for 'left, 'center or 'right."
  (interactive
   (list (intern-soft
	  (completing-read "Justification (left): " '(left center right)
			   nil t nil nil 'left))))

  (let* ((ov (ov-at))
	 (beg (ov-beg ov))
	 (end (ov-end ov))
	 (shift (- beg (line-beginning-position)))
	 (img (overlay-get ov 'display))
	 (img (and (and img (consp img) (eq (car img) 'image)
			(image-type-available-p (plist-get (cdr img) :type)))
		   img))
	 space-left offset)
    (when (and img (= beg (line-beginning-position)))
      (setq space-left (- (window-max-chars-per-line) (car (image-display-size img)))
	    offset (floor (cond
			   ((eq justification 'center)
			    (- (/ space-left 2) shift))
			   ((eq justification 'right)
			    (- space-left shift))
			   (t
			    0))))
      (when (>= offset 0)
	(overlay-put ov 'before-string (make-string offset ?\ ))))))

(defun org-latex-fragment-justify-advice (beg end image imagetype)
  "After advice function to justify fragments."
  (org-latex-fragment-justify (or (plist-get org-format-latex-options :justify) 'left)))

(advice-add 'org--format-latex-make-overlay :after 'org-latex-fragment-justify-advice)

;; ** numbering latex equations
(defun org-renumber-environment (orig-func &rest args)
  "A function to inject numbers in LaTeX fragment previews."
  (let ((results '())
	(counter -1)
	(numberp))

    (setq results (loop for (begin .  env) in
			(org-element-map (org-element-parse-buffer) 'latex-environment
			  (lambda (env)
			    (cons
			     (org-element-property :begin env)
			     (org-element-property :value env))))
			collect
			(cond
			 ((and (string-match "\\\\begin{equation}" env)
			       (not (string-match "\\\\tag{" env)))
			  (incf counter)
			  (cons begin counter))
			 ((string-match "\\\\begin{align}" env)
			  (prog2
			      (incf counter)
			      (cons begin counter)
			    (with-temp-buffer
			      (insert env)
			      (goto-char (point-min))
			      ;; \\ is used for a new line. Each one leads to a number
			      (incf counter (count-matches "\\\\$"))
			      ;; unless there are nonumbers.
			      (goto-char (point-min))
			      (decf counter (count-matches "\\nonumber")))))
			 (t
			  (cons begin nil)))))

    (when (setq numberp (cdr (assoc (point) results)))
      (setf (car args)
	    (concat
	     (format "\\setcounter{equation}{%s}\n" numberp)
	     (car args)))))

  (apply orig-func args))

(advice-add 'org-create-formula-image :around #'org-renumber-environment)
```


<a id="orgce255af"></a>

## improve emacs visualing nonstd symbols.     :programming:

-   degree sign
-   volume units.


<a id="orgf3fbd0c"></a>

## capture has a strange indentation     :programming:

-   C-h a on "indentation"


<a id="org7bc808f"></a>

## to prevent org-babel large output causing system hang.


<a id="org87af6e1"></a>

## chinese-fonts-setup     :MELPA_ori:

```
(require 'chinese-fonts-setup)
(chinese-fonts-setup-enable)
(set-face-attribute
 'default nil
 :font (font-spec :name "-*-Monaco-normal-normal-normal-*-*-*-*-*-m-0-iso10646-1"
		  :weight 'normal
		  :slant 'normal
		  :size 12.5))
(dolist (charset '(kana han symbol cjk-misc bopomofo))
  (set-fontset-font
   (frame-parameter nil 'font)
   charset
   (font-spec :name "-*-STKaiti-normal-normal-normal-*-*-*-*-*-p-0-iso10646-1"
	      :weight 'normal
	      :slant 'normal
	      :size 15.0)))
```
