config.org
** CANCELED python and Ipython ([[http://www.jesshamrick.com/2012/09/18/emacs-as-a-python-ide/][configuration ref.]])
#+BEGIN_SRC
; use IPython
(setq-default py-shell-name "ipython")
(setq-default py-which-bufname "IPython")
; use the wx backend, for both mayavi and matplotlib
(setq py-python-command-args
  '("--gui=wx" "--pylab=wx" "-colors" "Linux"))
(setq py-force-py-shell-name-p t)

; switch to the interpreter after executing code
(setq py-shell-switch-buffers-on-execute-p t)
(setq py-switch-buffers-on-execute-p t)
; don't split windows
(setq py-split-windows-on-execute-p nil)
; try to automagically figure out indentation
(setq py-smart-indentation t)

#+END_SRC

** TODO loading yas with in-used mode only
    :LOGBOOK:
    - State "TODO"       from              [2017-03-10 Fri 12:27]
    :END:
- loading the whole yas turn to slows the system.
** CANCELED TWO-mode mode: src block as end of programming mode from [[https://github.com/dandavison/emacs-config/blob/master/old/emacs.org][danDavision]]
#+BEGIN_SRC
(setq default-mode (list "org-mode" 'org-mode))
(setq second-modes '(("python" "#+begin_src python" "#+end_src" python-mode)
		     ("emacs-lisp" "#+begin_src emacs-lisp" "#+end_src" emacs-lisp-mode)
		     ("ess" "#+begin_src R" "#+end_src" ess-mode)
		     ))

#+END_SRC
*** CANCELED define org source face
#+begin_src
(defface org-block-begin-line
  '((t (:underline "#A7A6AA" :foreground "#008ED1" :background "#8ed100")))
  "Face used for the line delimiting the begin of source blocks.")

(defface org-block
  ;; defface org-block-background was removed from org: http://emacs.stackexchange.com/questions/14824/org-block-background-font-not-having-effect
  '((t (:background "gray20")))
  "Face used for the source block background.")


(defface org-block-end-line
  '((t (:underline "#A7A6AA" :foreground "#008ED1")))
  "Face used for the line delimiting the end of source blocks.")
#+end_src
** TODO capture template for ~config.org~ future improvement.
** TODO org-bullet
** DONE define a macro for fast table setup: two hline and three vline
** TODO design an hydra for toggling 
** TODO what is the differnce between ~org-edit-special~ and ~org-babel-expand-src-block~
** TODO setup subword mode for programme mode.
** TODO a mechanism that convert org table to list, and visa versa. 
** TODO I have a list of R function. I want to push to github and these fucntion is loaded into R automatically when ever i initiate R.
** TODO jump to pdf to a specific page number. 
** TODO org reveal to visualize 
  :LOGBOOK:
  - State "TODO"       from              <2017-07-04 Tue 10:44>
  :END:


  


