config.md


<a id="org77235c2"></a>

## org bullets

-   org-bullet mode


<a id="orge7c084b"></a>

## python and Ipython ([configuration ref.](http://www.jesshamrick.com/2012/09/18/emacs-as-a-python-ide/))

```
; use IPython
(setq-default py-shell-name "ipython")
(setq-default py-which-bufname "IPython")
; use the wx backend, for both mayavi and matplotlib
(setq py-python-command-args
  '("--gui=wx" "--pylab=wx" "-colors" "Linux"))
(setq py-force-py-shell-name-p t)

; switch to the interpreter after executing code
(setq py-shell-switch-buffers-on-execute-p t)
(setq py-switch-buffers-on-execute-p t)
; don't split windows
(setq py-split-windows-on-execute-p nil)
; try to automagically figure out indentation
(setq py-smart-indentation t)
```


<a id="org5555382"></a>

## loading yas with in-used mode only

-   loading the whole yas turn to slows the system.


<a id="org268968a"></a>

## TWO-mode mode: src block as end of programming mode from [danDavision](https://github.com/dandavison/emacs-config/blob/master/old/emacs.org)

```
(setq default-mode (list "org-mode" 'org-mode))
(setq second-modes '(("python" "#+begin_src python" "#+end_src" python-mode)
		     ("emacs-lisp" "#+begin_src emacs-lisp" "#+end_src" emacs-lisp-mode)
		     ("ess" "#+begin_src R" "#+end_src" ess-mode)
		     ))
```


<a id="orgad04241"></a>

### define org source face

```
(defface org-block-begin-line
  '((t (:underline "#A7A6AA" :foreground "#008ED1" :background "#8ed100")))
  "Face used for the line delimiting the begin of source blocks.")

(defface org-block
  ;; defface org-block-background was removed from org: http://emacs.stackexchange.com/questions/14824/org-block-background-font-not-having-effect
  '((t (:background "gray20")))
  "Face used for the source block background.")


(defface org-block-end-line
  '((t (:underline "#A7A6AA" :foreground "#008ED1")))
  "Face used for the line delimiting the end of source blocks.")
```


<a id="org9804194"></a>

## capture template for `config.org` future improvement.


<a id="orga7874d4"></a>

## org-bullet


<a id="org9f0bd66"></a>

## define a macro for fast table setup: two hline and three vline


<a id="org5d5093b"></a>

## design an hydra for toggling


<a id="org686a800"></a>

## what is the differnce between `org-edit-special` and `org-babel-expand-src-block`


<a id="org465742d"></a>

## setup subword mode for programme mode.


<a id="org7e5f048"></a>

## a mechanism that convert org table to list, and visa versa.


<a id="org9cae631"></a>

## I have a list of R function. I want to push to github and these fucntion is loaded into R automatically when ever i initiate R.


<a id="org2507096"></a>

## jump to pdf to a specific page number.


<a id="org449f820"></a>

## org reveal to visualize